Repository: htacg/tidy-html5
Catalog: localize/translations/language_*.po
Languages: sr

# TidyMuteReports
source: Use this option to prevent Tidy from displaying certain types of report output, for example, for conditions that you wish to ignore. <br/>This option takes a list of one or more keys indicating the message type to mute. You can discover these message keys by using the <code>mute-id</code> configuration option and examining Tidy's output.
sr: Овом опцијом спречавате Tidy да прикаже одређене типове излазних извештаја, на пример, у случају услова које желите да се игноришу. <br/>Вредност ове опције је листа једног или више кључева који означавају тип поруке која се потискује. Ове кључеве порука можете открити употребом <code>mute-id</code> опције конфигурације и испитивањем излаза који Tidy онда генерише.

# TidyMuteShow
source: This option indicates whether or not Tidy should display message ID's with each of its error reports. This could be useful if you wanted to use the <code>mute</code> configuration option in order to filter out certain report messages.
sr: Ова опција наводи да ли Tidy треба да прикаже ID порука у сваком од извештаја о грешкама. Ово може бити корисно када желите да употребите <code>mute</code> опцију конфигурације како би филтрирали одређене поруке у извештају.

# TidyStrictTagsAttr
source: This options ensures that tags and attributes are applicable for the version of HTML that Tidy outputs. When set to <var>yes</var> and the output document type is a strict doctype, then Tidy will report errors. If the output document type is a loose or transitional doctype, then Tidy will report warnings. <br/>Additionally if <code>drop-proprietary-attributes</code> is enabled, then not applicable attributes will be dropped, too. <br/>When set to <var>no</var>, these checks are not performed.
sr: Ова опција обезбеђује да су ознаке и атрибути које Tidy исписује на излаз у сагласности са HTML верзијом. Када се постави на <var>yes</var> и тип излазног документа је strict doctype, онда ће Tidy да пријави грешке. Ако је тип излазног документа loose или transitional doctype, онда ће Tidy да пријави упозорења. <br/>Уз то, ако је укључена опција <code>drop-proprietary-attributes</code>, онда се такође одбацују и атрибути који не постоје у HTML верзији. <br/>Када се постави на <var>no</var>, ове провере се не извршавају.

# TidyTabSize
source: This option specifies the number of columns that Tidy uses between successive tab stops. It is used to map tabs to spaces when reading the input.
sr: Ова опција наводи број колона које Tidy користи између две узастопне станице табулатора. Користи се за мапирање табулатора у размаке током читања улаза.

# TidyUpperCaseAttrs
source: This option specifies if Tidy should output attribute names in upper case. <br/>When set to <var>no</var>, attribute names will be written in lower case. Specifying <var>yes</var> will output attribute names in upper case, and <var>preserve</var> can used to leave attribute names untouched. <br/>When using XML input, the original case is always preserved.
sr: Ова опција наводи да ли би Tidy требало да имена атрибута исписује великим словима. <br/>Када се постави на <var>no</var>, имена атрибута ће се исписивати малим словима. Ако наведете <var>yes</var> имена атрибута ће се исписивати великим словима, а <var>preserve</var> може да се употреби када желите да се имена атрибута оставе неизмењена. <br/>Када се користи XML улаз, увек се задржава оригинална величина слова.

# TidyUpperCaseTags
source: This option specifies if Tidy should output tag names in upper case. <br/>The default is <var>no</var> which results in lower case tag names, except for XML input where the original case is preserved.
sr: Ова опција наводи да ли би Tidy требало да исписује имена ознака великим словима. <br/>Подразумевана вредност је <var>no</var> којом се добијају имена ознака исписана малим словима, осим за XML улаз где се задржава оригинална величина слова.

# TidyUseCustomTags
source: This option enables the use of tags for autonomous custom elements, e.g. <code>&lt;flag-icon&gt;</code> with Tidy. Custom tags are disabled if this value is <var>no</var>. Other settings - <var>blocklevel</var>, <var>empty</var>, <var>inline</var>, and <var>pre</var> will treat <em>all</em> detected custom tags accordingly. <br/>The use of <code>new-blocklevel-tags</code>, <code>new-empty-tags</code>, <code>new-inline-tags</code>, or <code>new-pre-tags</code> will override the treatment of custom tags by this configuration option. This may be useful if you have different types of custom tags.<br/>When enabled these tags are determined during the processing of your document using opening tags; matching closing tags will be recognized accordingly, and unknown closing tags will be discarded.
sr: Ова опција омогућава да се са Tidy користе ознаке за аутономне произвољне елементе, нпр. <code>&lt;flag-icon&gt;</code>. Произвољне ознаке су искључене када је њена вредност <var>no</var>. Остала подешавања - <var>blocklevel</var>, <var>empty</var>, <var>inline</var>, и <var>pre</var> ће третирати <em>све</em> детектоване произвољне ознаке на одговарајући начин наведен у вредности. <br/>Употрба <code>new-blocklevel-tags</code>, <code>new-empty-tags</code>, <code>new-inline-tags</code>, или <code>new-pre-tags</code> ће да премости третман произвољних ознака овом опцијом конфигурације. Ово може да буде корисно ако имате различите типове произвољних ознака.<br/>Када је укључена, ове ознаке се одређују током обраде вашег документа користећи отварајуће ознаке; одговарајуће затварајуће ознаке ће се препознати сагласно њима, а непознате затварајуће ознаке ће се одбацити.

# TidyVertSpace
source: This option specifies if Tidy should add some extra empty lines for readability. <br/>The default is <var>no</var>. <br/>If set to <var>auto</var> Tidy will eliminate nearly all newline characters.
sr: Ова опција наводи да ли би Tidy требало да дода мало додатних празних линија како би се побољшала читљивост. <br/>Подразумевана вредност је <var>no</var>. <br/>Ако се постави на <var>auto</var> Tidy ће да елиминише скоро све карактере прелома реда.

# TidyWarnPropAttrs
source: This option specifies if Tidy should warn on proprietary attributes.
sr: Ова опција наводи да ли би Tidy требало да упозори на постојање власничких атрибута.

# TidyWord2000
source: This option specifies if Tidy should go to great pains to strip out all the surplus stuff Microsoft Word 2000 inserts when you save Word documents as "Web pages". It doesn't handle embedded images or VML. <br/>You should consider saving using Word's <strong>Save As...</strong>, and choosing <strong>Web Page, Filtered</strong>.
sr: Ова опција наводи да ли би Tidy требало максимално да се потруди и скине све додатне ствари које Microsoft Word 2000 умеће у документ који Word чува као „Web pages”. Не обрађује уграђене слике или VML. <br/>Требало би да размотрите могућност да искористите команду <strong>Save As...</strong> програма Word, па да изаберете <strong>Web Page, Filtered</strong>.

# TidyWrapAsp
source: This option specifies if Tidy should line wrap text contained within ASP pseudo elements, which look like: <code>&lt;% ... %&gt;</code>.
sr: Ова опција наводи да ли би Tidy требало да обавија линије које се садрже унутар ASP псеудо елемената, који изгледају као: <code>&lt;% ... %&gt;</code>.

# TidyWrapAttVals
source: This option specifies if Tidy should line-wrap attribute values, meaning that if the value of an attribute causes a line to exceed the width specified by <code>wrap</code>, Tidy will add one or more line breaks to the value, causing it to be wrapped into multiple lines. <br/>Note that this option can be set independently of <code>wrap-script-literals</code>. By default Tidy replaces any newline or tab with a single space and replaces any sequences of whitespace with a single space. <br/>To force Tidy to preserve the original, literal values of all attributes, and ensure that whitespace characters within attribute values are passed through unchanged, set <code>literal-attributes</code> to <var>yes</var>.
sr: Ова опција наводи да ли би Tidy требало да обавија линије на вредностима атрибута, што значи да ако вредност атрибута учини да линија постане дужа од ширине наведене опцијом <code>wrap</code>, Tidy ће да дода један или више прелома линије у вредност, па ће се он тако преломити у више линија. <br/>Имајте на уму да се ова опција може поставити независно у односу на <code>wrap-script-literals</code> опцију. Tidy подразумевано замењује све преломе редова или табулаторе једним размаком и замењује све низове карактера празног простора једним размаком. <br/>Ако желите да Tidy обавезно задржи оригиналне, дословне вредности свих атрибута, и обезбедите да се карактери празног простора унутар атрибута прослеђују неизмењени на излаз, поставите опцију <code>literal-attributes</code> на <var>yes</var>.

# TidyWrapJste
source: This option specifies if Tidy should line wrap text contained within JSTE pseudo elements, which look like: <code>&lt;# ... #&gt;</code>.
sr: Ова опција наводи да ли би Tidy требало да обавија линију на тексту који се налази унутар JSTE псеудо елемената, који изгледају овако: <code>&lt;# ... #&gt;</code>.

# TidyWrapLen
source: This option specifies the right margin Tidy uses for line wrapping. <br/>Tidy tries to wrap lines so that they do not exceed this length. <br/>Set <code>wrap</code> to <var>0</var> (zero) if you want to disable line wrapping.
sr: Ова опција наводи десну маргину коју Tidy користи за обавијање линије. <br/>Tidy се труди да обавија линије тако да њихова дужина не прекорачи ову дужину. <br/>Поставите <code>wrap</code> на <var>0</var> (нулу) ако желите да искључите обавијање линије.

# TidyWrapPhp
source: This option specifies if Tidy should add a new line after a PHP pseudo elements, which look like: <code>&lt;?php ... ?&gt;</code>.
sr: Ова опција наводи да ли би Tidy требало да дода нову линију након PHP псеудо елемената, који изгледају овако: <code>&lt;?php ... ?&gt;</code>.

# TidyWrapScriptlets
source: This option specifies if Tidy should line wrap string literals assigned to element event handler attributes, such as element.onmouseover().
sr: Ова опција наводи да ли би Tidy требало да обавија стринг дословне вредности додељене атрибутима елемента који служе за обрађивач догађаја, као што је element.onmouseover().

# TidyWrapSection
source: This option specifies if Tidy should line wrap text contained within <code>&lt;![ ... ]&gt;</code> section tags.
sr: Ова опција наводи да ли би Tidy требало да обавија текст који се налази унутар <code>&lt;![ ... ]&gt;</code> ознака одељка.

# TidyWriteBack
source: This option specifies if Tidy should write back the tidied markup to the same file it read from. <br/>You are advised to keep copies of important files before tidying them, as on rare occasions the result may not be what you expect.
sr: Ова опција наводи да ли би Tidy требало да сређени означени текст упише назад фајл из којег је прочитао оригинални документ. <br/>Саветујемо вам да чувате копије важних фајлова пре него што их средите, јер резултат у ретким случајевима можда неће бити оно што очекујете.

# TidyXhtmlOut
source: This option specifies if Tidy should generate pretty printed output, writing it as extensible HTML. <br/>This option causes Tidy to set the DOCTYPE and default namespace as appropriate to XHTML, and will use the corrected value in output regardless of other sources. <br/>For XHTML, entities can be written as named or numeric entities according to the setting of <code>numeric-entities</code>. <br/>The original case of tags and attributes will be preserved, regardless of other options.
sr: Ова опција наводи да ли би Tidy требало да генерише лепо исписани излаз, записујући га као прошириви HTML. <br/>Ова опција приморава Tidy да постави DOCTYPE и подразумевани простор имена онако како то одговара за XHTML, и на излазу ће користити исправљену вредност без обзира на остале изворе. <br/>У XHTML, ентитети могу да се запишу као именовани или нумерички ентитети, сагласно са вредности опције <code>numeric-entities</code>. <br/>Оригинална величина слова ознака и атрибута ће се очувати, без обзира на вредности осталих опција.

# TidyXmlDecl
source: This option specifies if Tidy should add the XML declaration when outputting XML or XHTML. <br/>Note that if the input already includes an <code>&lt;?xml ... ?&gt;</code> declaration then this option will be ignored. <br/>If the encoding for the output is different from <var>ascii</var>, one of the <var>utf*</var> encodings, or <var>raw</var>, then the declaration is always added as required by the XML standard.
sr: Ова опција наводи да ли би Tidy требало да дода XML декларацију када исписује XML или XHTML. <br/>Имајте на уму да ако улаз већ садржи <code>&lt;?xml ... ?&gt;</code> декларацију, онда ће се ова опција игнорисати. <br/>Ако се кодирање за излаз није <var>ascii</var>, једно од <var>utf*</var> кодирања, или <var>raw</var>, онда се декларација увек додаје онако како то захтева XML стандард.

# TidyXmlOut
source: This option specifies if Tidy should pretty print output, writing it as well-formed XML. <br/>Any entities not defined in XML 1.0 will be written as numeric entities to allow them to be parsed by an XML parser. <br/>The original case of tags and attributes will be preserved, regardless of other options.
sr: Ова опција наводи да ли би Tidy требало да лепо испише излаз, записујући га као добро формирани XML. <br/>Сви ентитети који нису дефинисани у XML 1.0 ће се записивати као нумерички ентитети чиме се омогућава да их парсира XML парсер. <br/>Оригинална величина слова ознака и атрибута ће се очувати, без обзира на вредности осталих опција.

# TidyXmlPIs
source: This option specifies if Tidy should change the parsing of processing instructions to require <code>?&gt;</code> as the terminator rather than <code>&gt;</code>. <br/>This option is automatically set if the input is in XML.
sr: Ова опција наводи да ли би Tidy требало да промени парсирање инструкција обраде тако да се као терминатор уместо <code>&gt;</code> захтева <code>?&gt;</code>. <br/>Ова опција се аутоматски поставља ако је улаз на XML језику.

# TidyXmlSpace
source: This option specifies if Tidy should add <code>xml:space="preserve"</code> to elements such as <code>&lt;pre&gt;</code>, <code>&lt;style&gt;</code> and <code>&lt;script&gt;</code> when generating XML. <br/>This is needed if the whitespace in such elements is to be parsed appropriately without having access to the DTD.
sr: Ова опција наводи да ли би Tidy када генерише XML требало да у елементе као што су <code>&lt;pre&gt;</code>, <code>&lt;style&gt;</code> и <code>&lt;script&gt;</code> дода <code>xml:space="preserve"</code> <br/>Ово је потребно ако празан простор у таквим елементима треба да се парсира на погодан начин без потребе за приступом DTD документу.

# TidyXmlTags
source: This option specifies if Tidy should use the XML parser rather than the error correcting HTML parser.
sr: Ова опција наводи да ли би Tidy требало да уместо HTML парсера који исправља грешке користи XML парсер.

# TidyMetaCharset
source: This option, when enabled, adds a <code>&lt;meta&gt;</code> element and sets the <code>charset</code> attribute to the encoding of the document. Set this option to <var>yes</var> to enable it.
sr: Када је укључена, ова опција додаје <code>&lt;meta&gt;</code> елемент и поставља <code>charset</code> атрибут на кодирање документа. Поставите вредност опције на <var>yes</var> ако желите да је укључите.

# TidyShowMetaChange
source: This option enables a message whenever Tidy changes the <code>content</code> attribute of a meta charset declaration to match the encoding of the document. Set this option to <var>yes</var> to enable it.
sr: Ова порука укључује поруку кадгод Tidy измени the <code>content</code> атрибут meta charset декларације тако да се подудара са кодирањем документа. Поставите ову опцију на <var>yes</var> ако желите да је укључите.

# TidyStyleTags
source: This option specifies if Tidy should move all style tags to the head of the document.
sr: Ова опција наводи да ли би Tidy требало да премести све ознаке стилова у заглавље документа.

# TidyInfo
source: Info:
sr: Инфо:

# TidyWarning
source: Warning:
sr: Упозорење:

# TidyConfig
source: Config:
sr: Конфиг:

# TidyAccess
source: Access:
sr: Приступ:

# TidyError
source: Error:
sr: Грешка:

# TidyBadDocument
source: Document:
sr: Документ:

# TidyFatal
source: Panic:
sr: Паника:

# TidyDialogueSummary
source: Summary:
sr: Резиме:

# TidyDialogueInfo
source: Information:
sr: Информација:

# TidyDialogueFootnote
source: Footnote:
sr: Фуснота:

# LINE_COLUMN_STRING
source: line %d column %d -
sr: линија %d колона %d -

# FN_LINE_COLUMN_STRING
source: %s: line %d column %d -
sr: %s: линија %d колона %d -

# STRING_DISCARDING
source: discarding
sr: одбацује се

# STRING_ERROR_COUNT_ERROR
source: error
sr: грешка

# STRING_ERROR_COUNT_WARNING
source: warning
sr: упозорење

# STRING_HELLO_ACCESS
source: Accessibility Checks:
sr: Провере приступачности:

# STRING_HTML_PROPRIETARY
source: HTML Proprietary
sr: HTML власнички

# STRING_XML_DECLARATION
source: XML declaration
sr: XML декларација

# STRING_PLAIN_TEXT
source: plain text
sr: чисти текст

# STRING_REPLACING
source: replacing
sr: замењује се

# STRING_SPECIFIED
source: specified
sr: наведено

# TIDYCUSTOMNO_STRING
source: no
sr: не

# TIDYCUSTOMBLOCKLEVEL_STRING
source: block level
sr: блоковски ниво

# TIDYCUSTOMEMPTY_STRING
source: empty
sr: празно

# TIDYCUSTOMINLINE_STRING
source: inline
sr: унутар линије

# TIDYCUSTOMPRE_STRING
source: pre
sr: преформатирано

# TEXT_HTML_T_ALGORITHM
source: - First, search left from the cell's position to find row header cells. - Then search upwards to find column header cells. - The search in a given direction stops when the edge of the table is reached or when a data cell is found after a header cell. - Row headers are inserted into the list in the order they appear in the table. - For left-to-right tables, headers are inserted from left to right. - Column headers are inserted after row headers, in the order they appear in the table, from top to bottom. - If a header cell has the headers attribute set, then the headers referenced by this attribute are inserted into the list and the search stops for the current direction. TD cells that set the axis attribute are also treated as header cells.
sr: - Најпре, претражи лево од позиције ћелије да пронађеш ћелије заглавља реда. - Затим претражуј навише да пронађеш колону ћелија заглавља. - Претрага у датом смеру се зауставља када се достигне ивица табеле или када се након ћелије заглавља пронађе ћелија података. - Заглавља редова се умећу у листу у редоследу по којем се јављају у табели. - У случају лево-у-десно табела, заглавља се умећу с лева у десно. - Заглавља колона се умећу након заглавља реда, у редоследу по којем се појављују у табели, од врха ка дну. - Ако ћелија заглавља има постављене атрибуте заглавља, онда се заглавља на која указује тај атрибут умећу у листу и претрага у текућем смеру се зауставља. TD ћелије које постављају атрибут axis се такође третирају као ћелије заглавља.

# TEXT_VENDOR_CHARS
source: It is unlikely that vendor-specific, system-dependent encodings work widely enough on the World Wide Web; you should avoid using the %s character encoding, instead you are recommended to use named entities, e.g. &trade;.
sr: Мало је вероватно да су кодирања специфична за произвођача и зависна од система широко распрострањена на World Wide Web; не би требало да користите %s кодирање карактера, уместо њега се препоручује да употребите именоване ентитете, нпр. &trade;.

# TEXT_SGML_CHARS
source: Character codes 128 to 159 (U+0080 to U+009F) are not allowed in HTML; even if they were, they would likely be unprintable control characters. Tidy assumed you wanted to refer to a character with the same byte value in the %s encoding and replaced that reference with the Unicode equivalent.
sr: Кодови карактера од 128 до 159 (U+0080 до U+009F) нису дозвољени у HTML; чак и да јесу, највероватније би то били контролни карактери који не могу да се прикажу. Tidy је претпоставио да сте мислили на карактер који има исту бајт вредност у %s кодирању, па је ту референцу заменио Unicode еквивалентом.

# TEXT_INVALID_UTF8
source: Character codes for UTF-8 must be in the range: U+0000 to U+10FFFF. The definition of UTF-8 in Annex D of ISO/IEC 10646-1:2000 also allows for the use of five- and six-byte sequences to encode characters that are outside the range of the Unicode character set; those five- and six-byte sequences are illegal for the use of UTF-8 as a transformation of Unicode characters. ISO/IEC 10646 does not allow mapping of unpaired surrogates, nor U+FFFE and U+FFFF (but it does allow other noncharacters). For more information please refer to https://home.unicode.org/ and https://www.cl.cam.ac.uk/~mgk25/unicode.html
sr: Кодови карактера за UTF-8 морају бити у опсегу: U+0000 до U+10FFFF. Дефиниција UTF-8 у Анексу D стандарда ISO/IEC 10646-1:2000 такође дозвољава употребу низова од пет и шест бајтова за кодирање карактера који се налазе ван опсега Unicode скупа карактера; ти петобајтни и шестобајтни низови нису дозвољени за употребу у UTF-8 као трансформацији Unicode карактера. ISO/IEC 10646 не дозвољава мапирање неупарених сурогата, нити U+FFFE ни U+FFFF (али дозвољава остале не-карактере). Ако вам је потребно више информација, молимо вас да погледате https://home.unicode.org/ и https://www.cl.cam.ac.uk/~mgk25/unicode.html

# TEXT_INVALID_UTF16
source: Character codes for UTF-16 must be in the range: U+0000 to U+10FFFF. The definition of UTF-16 in Annex C of ISO/IEC 10646-1:2000 does not allow the mapping of unpaired surrogates. For more information please refer to https://home.unicode.org/ and https://www.cl.cam.ac.uk/~mgk25/unicode.html
sr: Кодови карактера за UTF-16 морају бити у опсегу: U+0000 до U+10FFFF. Дефиниција UTF-16 у Анексу C стандарда ISO/IEC 10646-1:2000 не дозвољава мапирање неупарених сурогата. За више информација, молимо вас да погледате https://home.unicode.org/ и https://www.cl.cam.ac.uk/~mgk25/unicode.html

# TEXT_INVALID_URI
source: URIs must be properly escaped, they must not contain unescaped characters below U+0021 including the space character and not above U+007E. Tidy escapes the URI for you as recommended by HTML 4.01 section B.2.1 and XML 1.0 section 4.2.2. Some user agents use another algorithm to escape such URIs and some server-sided scripts depend on that. If you want to depend on that, you must escape the URI on your own. For more information please refer to https://www.w3.org/International/O-URL-and-ident.html
sr: URI идентификатори моја бити исправно означени, они не смеју да садрже карактере испод U+0021 укључујући и карактер размака, као и карактере изнад U+007E. Tidy за вас означава URI онако као се препоручује у HTML 4.01 одељку B.2.1 и у XML 1.0 одељку 4.2.2. Неки кориснички агенти користе другачији алгоритам за означавање таквих URI идентификатора, а неке скрипте на страни сервера зависе од тога. Ако желите ту зависност, онда сами морате да означите URI. Ако вам је потребно више информација, молимо вас да погледате https://www.w3.org/International/O-URL-and-ident.html
