Repository: htacg/tidy-html5
Catalog: localize/translations/language_*.po
Languages: sr

# AREA_MISSING_ALT
source: [1.1.9.1]: <area> missing 'alt' text.
sr: [1.1.9.1]: <area> недостаје ’alt’ текст.

# SCRIPT_MISSING_NOSCRIPT
source: [1.1.10.1]: <script> missing <noscript> section.
sr: [1.1.10.1]: <script> недостаје <noscript> одељак.

# ASCII_REQUIRES_DESCRIPTION
source: [1.1.12.1]: ascii art requires description.
sr: [1.1.12.1]: потребан је опис ascii слике.

# IMG_MAP_SERVER_REQUIRES_TEXT_LINKS
source: [1.2.1.1]: image map (server-side) requires text links.
sr: [1.2.1.1]: слика мапа (на страни сервера) захтева текст линкове.

# MULTIMEDIA_REQUIRES_TEXT
source: [1.4.1.1]: multimedia requires synchronized text equivalents.
sr: [1.4.1.1]: за мултимедију су потребни еквиваленти синхронизованог текста.

# IMG_MAP_CLIENT_MISSING_TEXT_LINKS
source: [1.5.1.1]: image map (client-side) missing text links.
sr: [1.5.1.1]: у мапи слици (на страни клијента) недостају текст линкови.

# INFORMATION_NOT_CONVEYED_IMAGE
source: [2.1.1.1]: ensure information not conveyed through color alone (image).
sr: [2.1.1.1]: обезбедите да се информација не преноси само бојом (image).

# INFORMATION_NOT_CONVEYED_APPLET
source: [2.1.1.2]: ensure information not conveyed through color alone (applet).
sr: [2.1.1.2]: обезбедите да се информација не преноси само бојом (applet).

# INFORMATION_NOT_CONVEYED_OBJECT
source: [2.1.1.3]: ensure information not conveyed through color alone (object).
sr: [2.1.1.3]: обезбедите да се информација не преноси само бојом (object).

# INFORMATION_NOT_CONVEYED_SCRIPT
source: [2.1.1.4]: ensure information not conveyed through color alone (script).
sr: [2.1.1.4]: обезбедите да се информација не преноси само бојом (script).

# INFORMATION_NOT_CONVEYED_INPUT
source: [2.1.1.5]: ensure information not conveyed through color alone (input).
sr: [2.1.1.5]: обезбедите да се информација не преноси само бојом (input).

# COLOR_CONTRAST_TEXT
source: [2.2.1.1]: poor color contrast (text).
sr: [2.2.1.1]: слаб контраст боје (текст).

# COLOR_CONTRAST_LINK
source: [2.2.1.2]: poor color contrast (link).
sr: [2.2.1.2]: слаб контраст боје (линк).

# COLOR_CONTRAST_ACTIVE_LINK
source: [2.2.1.3]: poor color contrast (active link).
sr: [2.2.1.3]: слаб контраст боје (активни линк).

# COLOR_CONTRAST_VISITED_LINK
source: [2.2.1.4]: poor color contrast (visited link).
sr: [2.2.1.4]: слаб контраст боје (посећени линк).

# DOCTYPE_MISSING
source: [3.2.1.1]: <doctype> missing.
sr: [3.2.1.1]: недостаје <doctype>.

# STYLE_SHEET_CONTROL_PRESENTATION
source: [3.3.1.1]: use style sheets to control presentation.
sr: [3.3.1.1]: употребите листе стилова за контролу презентације.

# HEADERS_IMPROPERLY_NESTED
source: [3.5.1.1]: headers improperly nested.
sr: [3.5.1.1]: заглавља нису исправно угњеждена.

# POTENTIAL_HEADER_BOLD
source: [3.5.2.1]: potential header (bold).
sr: [3.5.2.1]: потенцијално заглавље (подебљано).

# POTENTIAL_HEADER_ITALICS
source: [3.5.2.2]: potential header (italics).
sr: [3.5.2.2]: потенцијално заглавље (курзив).

# POTENTIAL_HEADER_UNDERLINE
source: [3.5.2.3]: potential header (underline).
sr: [3.5.2.3]: потенцијално заглавље (подвучено).

# HEADER_USED_FORMAT_TEXT
source: [3.5.3.1]: header used to format text.
sr: [3.5.3.1]: заглавље се користи за форматирање текста.

# LIST_USAGE_INVALID_UL
source: [3.6.1.1]: list usage invalid <ul>.
sr: [3.6.1.1]: неисправна употреба листе <ul>.

# LIST_USAGE_INVALID_OL
source: [3.6.1.2]: list usage invalid <ol>.
sr: [3.6.1.2]: неисправна употреба листе <ol>.

# LIST_USAGE_INVALID_LI
source: [3.6.1.4]: list usage invalid <li>.
sr: [3.6.1.4]: неисправна употреба листе <li>.

# LANGUAGE_NOT_IDENTIFIED
source: [4.3.1.1]: language not identified.
sr: [4.3.1.1]: није идентификован језик.

# LANGUAGE_INVALID
source: [4.3.1.2]: language attribute invalid.
sr: [4.3.1.2]: атрибут језика је неисправан.

# DATA_TABLE_MISSING_HEADERS
source: [5.1.2.1]: data <table> missing row/column headers (all).
sr: [5.1.2.1]: <table> података недостају заглавља редова/колона (сва).

# DATA_TABLE_MISSING_HEADERS_COLUMN
source: [5.1.2.2]: data <table> missing row/column headers (1 col).
sr: [5.1.2.2]: <table> података недостају заглавља редова/колона (1 кол).

# DATA_TABLE_MISSING_HEADERS_ROW
source: [5.1.2.3]: data <table> missing row/column headers (1 row).
sr: [5.1.2.3]: <table> података недостају заглавља редова/колона (1 ред).

# DATA_TABLE_REQUIRE_MARKUP_COLUMN_HEADERS
source: [5.2.1.1]: data <table> may require markup (column headers).
sr: [5.2.1.1]: <table> података - можда је потребно означавање (заглавља колоне).

# DATA_TABLE_REQUIRE_MARKUP_ROW_HEADERS
source: [5.2.1.2]: data <table> may require markup (row headers).
sr: [5.2.1.2]: <table> података - можда је потребно означавање (заглавља редова).

# LAYOUT_TABLES_LINEARIZE_PROPERLY
source: [5.3.1.1]: verify layout tables linearize properly.
sr: [5.3.1.1]: потврдите да се распоред табеле исправно линеаризује.

# LAYOUT_TABLE_INVALID_MARKUP
source: [5.4.1.1]: invalid markup used in layout <table>.
sr: [5.4.1.1]: у распореду <table> се користи неисправно означавање.

# TABLE_MISSING_SUMMARY
source: [5.5.1.1]: <table> missing summary.
sr: [5.5.1.1]: недостаје резиме за <table>.

# TABLE_SUMMARY_INVALID_NULL
source: [5.5.1.2]: <table> summary invalid (null).
sr: [5.5.1.2]: резиме за <table> није исправан (null).

# TABLE_SUMMARY_INVALID_SPACES
source: [5.5.1.3]: <table> summary invalid (spaces).
sr: [5.5.1.3]: резиме за <table> није исправан (размаци).

# TABLE_SUMMARY_INVALID_PLACEHOLDER
source: [5.5.1.6]: <table> summary invalid (placeholder text).
sr: [5.5.1.6]: резиме за <table> није исправан (текст чувара места).

# TABLE_MISSING_CAPTION
source: [5.5.2.1]: <table> missing <caption>.
sr: [5.5.2.1]: у <table> недостаје <caption>.

# TABLE_MAY_REQUIRE_HEADER_ABBR
source: [5.6.1.1]: <table> may require header abbreviations.
sr: [5.6.1.1]: можда су потребне скраћенице заглавља за <table>.

# TABLE_MAY_REQUIRE_HEADER_ABBR_NULL
source: [5.6.1.2]: <table> header abbreviations invalid (null).
sr: [5.6.1.2]: скраћенице заглавља за <table> су неисправне (null).

# TABLE_MAY_REQUIRE_HEADER_ABBR_SPACES
source: [5.6.1.3]: <table> header abbreviations invalid (spaces).
sr: [5.6.1.3]: скраћенице заглавља за <table> су неисправне (размаци).

# STYLESHEETS_REQUIRE_TESTING_LINK
source: [6.1.1.1]: style sheets require testing (link).
sr: [6.1.1.1]: потребна су тестирања листи стилова (линк).

# STYLESHEETS_REQUIRE_TESTING_STYLE_ELEMENT
source: [6.1.1.2]: style sheets require testing (style element).
sr: [6.1.1.2]: потребна су тестирања листи стилова (елемент style).

# STYLESHEETS_REQUIRE_TESTING_STYLE_ATTR
source: [6.1.1.3]: style sheets require testing (style attribute).
sr: [6.1.1.3]: потребна су тестирања листи стилова (атрибут style).

# FRAME_SRC_INVALID
source: [6.2.1.1]: <frame> source invalid.
sr: [6.2.1.1]: извор <frame> је неисправан.

# TEXT_EQUIVALENTS_REQUIRE_UPDATING_APPLET
source: [6.2.2.1]: text equivalents require updating (applet).
sr: [6.2.2.1]: потребно је ажурирање текст еквивалената (applet).

# TEXT_EQUIVALENTS_REQUIRE_UPDATING_SCRIPT
source: [6.2.2.2]: text equivalents require updating (script).
sr: [6.2.2.2]: потребно је ажурирање текст еквивалената (script).

# TEXT_EQUIVALENTS_REQUIRE_UPDATING_OBJECT
source: [6.2.2.3]: text equivalents require updating (object).
sr: [6.2.2.3]: потребно је ажурирање текст еквивалената (object).

# PROGRAMMATIC_OBJECTS_REQUIRE_TESTING_SCRIPT
source: [6.3.1.1]: programmatic objects require testing (script).
sr: [6.3.1.1]: потребно је тестирање програмских објеката (script).

# PROGRAMMATIC_OBJECTS_REQUIRE_TESTING_OBJECT
source: [6.3.1.2]: programmatic objects require testing (object).
sr: [6.3.1.2]: потребно је тестирање програмских објеката (object).

# PROGRAMMATIC_OBJECTS_REQUIRE_TESTING_EMBED
source: [6.3.1.3]: programmatic objects require testing (embed).
sr: [6.3.1.3]: потребно је тестирање програмских објеката (embed).

# PROGRAMMATIC_OBJECTS_REQUIRE_TESTING_APPLET
source: [6.3.1.4]: programmatic objects require testing (applet).
sr: [6.3.1.4]: потребно је тестирање програмских објеката (applet).

# FRAME_MISSING_NOFRAMES
source: [6.5.1.1]: <frameset> missing <noframes> section.
sr: [6.5.1.1]: за <frameset> недостаје <noframes> одељак.

# NOFRAMES_INVALID_NO_VALUE
source: [6.5.1.2]: <noframes> section invalid (no value).
sr: [6.5.1.2]: <noframes> одељак није исправан (нема вредност).

# NOFRAMES_INVALID_CONTENT
source: [6.5.1.3]: <noframes> section invalid (content).
sr: [6.5.1.3]: <noframes> одељак је неисправан (садржај).

# NOFRAMES_INVALID_LINK
source: [6.5.1.4]: <noframes> section invalid (link).
sr: [6.5.1.4]: <noframes> одељак је неисправан (линк).

# REMOVE_FLICKER_SCRIPT
source: [7.1.1.1]: remove flicker (script).
sr: [7.1.1.1]: уклоните треперење (script).

# REMOVE_FLICKER_OBJECT
source: [7.1.1.2]: remove flicker (object).
sr: [7.1.1.2]: уклоните треперење (object).

# REMOVE_FLICKER_EMBED
source: [7.1.1.3]: remove flicker (embed).
sr: [7.1.1.3]: уклоните треперење (embed).

# REMOVE_FLICKER_APPLET
source: [7.1.1.4]: remove flicker (applet).
sr: [7.1.1.4]: уклоните треперење (applet).

# REMOVE_FLICKER_ANIMATED_GIF
source: [7.1.1.5]: remove flicker (animated gif).
sr: [7.1.1.5]: уклоните треперење (animated gif).

# REMOVE_BLINK_MARQUEE
source: [7.2.1.1]: remove blink/marquee.
sr: [7.2.1.1]: уклоните blink/marquee.

# REMOVE_AUTO_REFRESH
source: [7.4.1.1]: remove auto-refresh.
sr: [7.4.1.1]: уклоните аутоматско освежавање.

# REMOVE_AUTO_REDIRECT
source: [7.5.1.1]: remove auto-redirect.
sr: [7.5.1.1]: уклоните аутоматско преусмеравање.

# ENSURE_PROGRAMMATIC_OBJECTS_ACCESSIBLE_SCRIPT
source: [8.1.1.1]: ensure programmatic objects are accessible (script).
sr: [8.1.1.1]: (script).

# ENSURE_PROGRAMMATIC_OBJECTS_ACCESSIBLE_OBJECT
source: [8.1.1.2]: ensure programmatic objects are accessible (object).
sr: [8.1.1.2]: обезбедите да су програмски објекти приступачни (object).

# ENSURE_PROGRAMMATIC_OBJECTS_ACCESSIBLE_APPLET
source: [8.1.1.3]: ensure programmatic objects are accessible (applet).
sr: [8.1.1.3]: обезбедите да су програмски објекти приступачни (applet).

# ENSURE_PROGRAMMATIC_OBJECTS_ACCESSIBLE_EMBED
source: [8.1.1.4]: ensure programmatic objects are accessible (embed).
sr: [8.1.1.4]: обезбедите да су програмски објекти приступачни (embed).

# IMAGE_MAP_SERVER_SIDE_REQUIRES_CONVERSION
source: [9.1.1.1]: image map (server-side) requires conversion.
sr: [9.1.1.1]: потребно је претварање слике мапе (на страни сервера).

# SCRIPT_NOT_KEYBOARD_ACCESSIBLE_ON_MOUSE_DOWN
source: [9.3.1.1]: <script> not keyboard accessible (onMouseDown).
sr: [9.3.1.1]: <script> није приступачан преко тастатуре (onMouseDown).

# SCRIPT_NOT_KEYBOARD_ACCESSIBLE_ON_MOUSE_UP
source: [9.3.1.2]: <script> not keyboard accessible (onMouseUp).
sr: [9.3.1.2]: <script> није приступачан преко тастатуре (onMouseUp).

# SCRIPT_NOT_KEYBOARD_ACCESSIBLE_ON_CLICK
source: [9.3.1.3]: <script> not keyboard accessible (onClick).
sr: [9.3.1.3]: <script> није приступачан преко тастатуре (onClick).

# SCRIPT_NOT_KEYBOARD_ACCESSIBLE_ON_MOUSE_OVER
source: [9.3.1.4]: <script> not keyboard accessible (onMouseOver).
sr: [9.3.1.4]: <script> није приступачан преко тастатуре (onMouseOver).

# SCRIPT_NOT_KEYBOARD_ACCESSIBLE_ON_MOUSE_OUT
source: [9.3.1.5]: <script> not keyboard accessible (onMouseOut).
sr: [9.3.1.5]: <script> није приступачан преко тастатуре (onMouseOut).

# SCRIPT_NOT_KEYBOARD_ACCESSIBLE_ON_MOUSE_MOVE
source: [9.3.1.6]: <script> not keyboard accessible (onMouseMove).
sr: [9.3.1.6]: <script> није приступачан преко тастатуре (onMouseMove).

# NEW_WINDOWS_REQUIRE_WARNING_NEW
source: [10.1.1.1]: new windows require warning (_new).
sr: [10.1.1.1]: потребно је упозорење у вези са новим прозорима (_new).

# NEW_WINDOWS_REQUIRE_WARNING_BLANK
source: [10.1.1.2]: new windows require warning (_blank).
sr: [10.1.1.2]: потребно је упозорење у вези са новим прозорима (_blank).

# REPLACE_DEPRECATED_HTML_APPLET
source: [11.2.1.1]: replace deprecated html <applet>.
sr: [11.2.1.1]: замените застарели html <applet>.

# REPLACE_DEPRECATED_HTML_BASEFONT
source: [11.2.1.2]: replace deprecated html <basefont>.
sr: [11.2.1.2]: замените застарели html <basefont>.

# REPLACE_DEPRECATED_HTML_CENTER
source: [11.2.1.3]: replace deprecated html <center>.
sr: [11.2.1.3]: замените застарели html <center>.

# REPLACE_DEPRECATED_HTML_DIR
source: [11.2.1.4]: replace deprecated html <dir>.
sr: [11.2.1.4]: замените застарели html <dir>.

# REPLACE_DEPRECATED_HTML_FONT
source: [11.2.1.5]: replace deprecated html <font>.
sr: [11.2.1.5]: замените застарели html <font>.

# REPLACE_DEPRECATED_HTML_ISINDEX
source: [11.2.1.6]: replace deprecated html <isindex>.
sr: [11.2.1.6]: замените застарели html <isindex>.

# REPLACE_DEPRECATED_HTML_MENU
source: [11.2.1.7]: replace deprecated html <menu>.
sr: [11.2.1.7]: замените застарели html <menu>.

# REPLACE_DEPRECATED_HTML_S
source: [11.2.1.8]: replace deprecated html <s>.
sr: [11.2.1.8]: замените застарели html <s>.

# REPLACE_DEPRECATED_HTML_STRIKE
source: [11.2.1.9]: replace deprecated html <strike>.
sr: [11.2.1.9]: замените застарели html <strike>.

# REPLACE_DEPRECATED_HTML_U
source: [11.2.1.10]: replace deprecated html <u>.
sr: [11.2.1.10]: замените застарели html <u>.

# FRAME_MISSING_TITLE
source: [12.1.1.1]: <frame> missing title.
sr: [12.1.1.1]: недостаје наслов за <frame>.

# FRAME_TITLE_INVALID_NULL
source: [12.1.1.2]: <frame> title invalid (null).
sr: [12.1.1.2]: није исправан наслова за <frame> (null).

# FRAME_TITLE_INVALID_SPACES
source: [12.1.1.3]: <frame> title invalid (spaces).
sr: [12.1.1.3]: није исправан наслова за <frame> (размаци).

# ASSOCIATE_LABELS_EXPLICITLY
source: [12.4.1.1]: associate labels explicitly with form controls.
sr: [12.4.1.1]: експлицитно придружите лабеле контролама формулара.

# ASSOCIATE_LABELS_EXPLICITLY_FOR
source: [12.4.1.2]: associate labels explicitly with form controls (for).
sr: [12.4.1.2]: експлицитно придружите лабеле контролама формулара (for).

# ASSOCIATE_LABELS_EXPLICITLY_ID
source: [12.4.1.3]: associate labels explicitly with form controls (id).
sr: [12.4.1.3]: експлицитно придружите лабеле контролама формулара (id).

# LINK_TEXT_NOT_MEANINGFUL
source: [13.1.1.1]: link text not meaningful.
sr: [13.1.1.1]: текст линка нема значење.

# LINK_TEXT_MISSING
source: [13.1.1.2]: link text missing.
sr: [13.1.1.2]: недостаје текст линка.

# LINK_TEXT_TOO_LONG
source: [13.1.1.3]: link text too long.
sr: [13.1.1.3]: дужина текста линка је сувише велика.

# LINK_TEXT_NOT_MEANINGFUL_CLICK_HERE
source: [13.1.1.4]: link text not meaningful (click here).
sr: [13.1.1.4]: текст линка нема значење (кликните овде).

# METADATA_MISSING
source: [13.2.1.1]: Metadata missing.
sr: [13.2.1.1]: Недостају метаподаци.

# METADATA_MISSING_REDIRECT_AUTOREFRESH
source: [13.2.1.3]: Metadata missing (redirect/auto-refresh).
sr: [13.2.1.3]: Недостају метаподаци (преусмеравање/ауто-освежавање).

# SKIPOVER_ASCII_ART
source: [13.10.1.1]: skip over ascii art.
sr: [13.10.1.1]: прескакање преко ascii уметности.

# TC_LABEL_COL
source: column
sr: колона

# TC_LABEL_FILE
source: file
sr: фајл

# TC_LABEL_LANG
source: lang
sr: језик

# TC_LABEL_LEVL
source: level
sr: ниво

# TC_LABEL_OPT
source: option
sr: опција

# TC_MAIN_ERROR_LOAD_CONFIG
source: Loading config file "%s" problems, err = %d
sr: Учитава се конфиг фајл „%s” проблеми, греш = %d

# TC_OPT_ACCESS
source: do additional accessibility checks (<level> = 0, 1, 2, 3). 0 is assumed if <level> is missing.
sr: ради додатне провере приступачности (<ниво> = 0, 1, 2, 3). 0 се подразумева у случају да недостаје <ниво>.

# TC_OPT_ASCII
source: use ISO-8859-1 for input, US-ASCII for output
sr: користи се ISO-8859-1 за улаз, US-ASCII за излаз

# TC_OPT_ASHTML
source: force XHTML to well formed HTML
sr: форсира XHTML у добро формирани HTML

# TC_OPT_ASXML
source: convert HTML to well formed XHTML
sr: претвара HTML у добро формирани XHTML

# TC_OPT_BARE
source: strip out smart quotes and em dashes, etc.
sr: уклања паметне наводе, ем црте, итд.

# TC_OPT_BIG5
source: use Big5 for both input and output
sr: користи се Big5 и за улаз и за излаз

# TC_OPT_CLEAN
source: replace FONT, NOBR and CENTER tags with CSS
sr: замењује FONT, NOBR и CENTER ознаке са CSS

# TC_OPT_CONFIG
source: set configuration options from the specified <file>
sr: поставља опције конфигурације из наведеног <фајл>

# TC_OPT_ERRORS
source: show only errors and warnings
sr: приказују се само грешке и упозорења

# TC_OPT_FILE
source: write errors and warnings to the specified <file>
sr: грешке и упозорења се исписују у наведени <file>

# TC_OPT_GDOC
source: produce clean version of html exported by Google Docs
sr: производи чисту верзију html кода извезеног из Google Docs

# TC_OPT_HELP
source: list the command line options
sr: исписује опције командне линије

# TC_OPT_HELPCFG
source: list all configuration options
sr: исписује све опције конфигурације

# TC_OPT_HELPENV
source: show information about the environment and runtime configuration
sr: приказује информације у вези са окружењем и конфигурацију која се користи током извршавања

# TC_OPT_HELPOPT
source: show a description of the <option>
sr: приказује опис <option>

# TC_OPT_IBM858
source: use IBM-858 (CP850+Euro) for input, US-ASCII for output
sr: користи се IBM-858 (CP850+Euro) за улаз, US-ASCII за излаз

# TC_OPT_INDENT
source: indent element content
sr: увлачи се садржај елемента

# TC_OPT_ISO2022
source: use ISO-2022 for both input and output
sr: користи се ISO-2022 и за улаз и за излаз

# TC_OPT_LANGUAGE
source: set Tidy's output language to <lang>. Specify '-language help' for more help. Use before output-causing arguments to ensure the language takes effect, e.g.,`tidy -lang es -lang help`.
sr: поставља излазни језик програма Tidy на <језик>. За више информација наведите. ’-language help’ Употребите пре аргумената који производе излаз да би се осигурало да се језик примењује.`tidy -lang es -lang help`.

# TC_OPT_LATIN0
source: use ISO-8859-15 for input, US-ASCII for output
sr: користи се ISO-8859-15 за улаз, US-ASCII за излаз

# TC_OPT_LATIN1
source: use ISO-8859-1 for both input and output
sr: користи се ISO-8859-1 и за улаз и за излаз

# TC_OPT_MAC
source: use MacRoman for input, US-ASCII for output
sr: користи се MacRoman за улаз, US-ASCII за излаз

# TC_OPT_MODIFY
source: modify the original input files
sr: измењују се оригинални улазни фајлови

# TC_OPT_NUMERIC
source: output numeric rather than named entities
sr: уместо именованих, исписују се нумерички ентитети

# TC_OPT_OMIT
source: omit optional start tags and end tags
sr: изостављају се отварајуће и затварајуће ознаке које нису обавезне

# TC_OPT_OUTPUT
source: write output to the specified <file>
sr: излаз се уписује у наведени <фајл>

# TC_OPT_QUIET
source: suppress nonessential output
sr: потискује се излаз који није од суштинског значаја

# TC_OPT_RAW
source: output values above 127 without conversion to entities
sr: вредности преко 127 се исписују без претварања у ентитете

# TC_OPT_SHIFTJIS
source: use Shift_JIS for both input and output
sr: користи се Shift_JIS и за улаз и за излаз

# TC_OPT_SHOWCFG
source: list the current configuration settings
sr: исписују се текућа подешавања конфигурације

# TC_OPT_EXP_CFG
source: list the current configuration settings, suitable for a config file
sr: исписују се текућа подешавања конфигурације, погодно је за конфиг фајл

# TC_OPT_EXP_DEF
source: list the default configuration settings, suitable for a config file
sr: испиисују подразумевана подешавања конфигурације, погодно је за конфиг фајл

# TC_OPT_UPPER
source: force tags to upper case
sr: форсира испис ознака великим словима

# TC_OPT_UTF16
source: use UTF-16 for both input and output
sr: користи се UTF-16 и за улаз и за излаз.

# TC_OPT_UTF16BE
source: use UTF-16BE for both input and output
sr: користи се UTF-16BE и за улаз и за излаз

# TC_OPT_UTF16LE
source: use UTF-16LE for both input and output
sr: користи се UTF-16LE и за улаз и за излаз

# TC_OPT_UTF8
source: use UTF-8 for both input and output
sr: користи се UTF-8 и за улаз и за излаз

# TC_OPT_VERSION
source: show the version of Tidy
sr: приказује верзију програма Tidy

# TC_OPT_WIN1252
source: use Windows-1252 for input, US-ASCII for output
sr: користи се Windows-1252 за улаз, US-ASCII за излаз

# TC_OPT_WRAP
source: wrap text at the specified <column>. 0 is assumed if <column> is missing. When this option is omitted, the default of the configuration option 'wrap' applies.
sr: текст се обавија на наведеној <колона>. Узима се 0 ако <колона> недостаје. Када се ова опција изостави, примењује се подразумевана вредност опције конфигурације ’wrap’.

# TC_OPT_XML
source: specify the input is well formed XML
sr: наводи да је улаз добро формирани XML

# TC_OPT_XMLCFG
source: list all configuration options in XML format
sr: исписују се све опције конфигурације у XML формату

# TC_OPT_XMLHELP
source: list the command line options in XML format
sr: исписују се све опције командне линије у XML формату

# TC_OPT_XMLSTRG
source: output all of Tidy's strings in XML format
sr: исписују се сви стрингови програма Tidy у XML формату

# TC_OPT_XMLERRS
source: output error constants and strings in XML format
sr: исписују се све константе грешке и стрингови у XML формату

# TC_OPT_XMLOPTS
source: output option descriptions in XML format
sr: исписују се описи опција у XML формату

# TC_STRING_CONF_HEADER
source: Configuration File Settings:
sr: Подешавања фајла конфигурације:

# TC_STRING_CONF_NAME
source: Name
sr: Назив

# TC_STRING_CONF_TYPE
source: Type
sr: Тип

# TC_STRING_CONF_VALUE
source: Current Value
sr: Текућа вредност

# TC_STRING_OPT_NOT_DOCUMENTED
source: Warning: option `%s' is not documented.
sr: Упозорење: опција ’%s’ није документована.

# TC_STRING_OUT_OF_MEMORY
source: Out of memory. Bailing out.
sr: Нема меморије. Спашавам се.

# TC_STRING_FATAL_ERROR
source: Fatal error: impossible value for id='%d'.
sr: Фатална грешка: немогућа вредност за id='%d'.

# TC_STRING_FILE_MANIP
source: File manipulation
sr: Манипулација фајловима

# TC_STRING_PROCESS_DIRECTIVES
source: Processing directives
sr: Обрада директива

# TC_STRING_CHAR_ENCODING
source: Character encodings
sr: Кодирања карактера

# TC_STRING_LANG_MUST_SPECIFY
source: A POSIX or Windows locale must be specified.
sr: Мора да се наведе POSIX или Windows локалитет.

# TC_STRING_LANG_NOT_FOUND
source: Tidy doesn't have language '%s,' will use '%s' instead.
sr: Tidy нема језик ’%s’, уместо њега ће користити ’%s’.

# TC_STRING_MISC
source: Miscellaneous
sr: Разно

# TC_STRING_MUST_SPECIFY
source: A Tidy option name must be specified.
sr: Мора да се наведе име Tidy опције.

# TC_STRING_UNKNOWN_OPTION
source: HTML Tidy: unknown option: %c
sr: HTML Tidy: непозната опција: %c

# TC_STRING_UNKNOWN_OPTION_B
source: HTML Tidy: unknown option.
sr: HTML Tidy: непозната опција.

# TC_STRING_VERS_A
source: HTML Tidy for %s version %s
sr: HTML Tidy за %s верзија %s

# TC_STRING_VERS_B
source: HTML Tidy version %s
sr: HTML Tidy верзија %s

# TC_TXT_HELP_1
source: %s [options...] [file...] [options...] [file...] Utility to clean up and pretty print HTML/XHTML/XML. This is modern HTML Tidy version %s.
sr: %s [опције...] [фајл...] [опције...] [фајл...] Алат који чисти и лепо исписује HTML/XHTML/XML. Ово је модерни HTML Tidy верзија %s.

# TC_TXT_HELP_2A
source: Command Line Arguments for HTML Tidy for %s:
sr: Аргументи команде линије за HTML Tidy за %s:

# TC_TXT_HELP_2B
source: Command Line Arguments for HTML Tidy:
sr: Аргументи команде линије за HTML Tidy:
