Repository: htacg/tidy-html5
Catalog: localize/translations/language_*.po
Languages: sr

# TEXT_BAD_FORM
source: You may need to move one or both of the <form> and </form> tags. HTML elements should be properly nested and form elements are no exception. For instance you should not place the <form> in one table cell and the </form> in another. If the <form> is placed before a table, the </form> cannot be placed inside the table! Note that one form can't be nested inside another!
sr: Можда је потребна да преместите једну или обе ознаке <form> и </form>. HTML елементи би требало да су исправно угњеждени, а form елементи нису изузетак. На пример, не би требало да поставите <form> у једну ћелију табеле, а </form> у другу. Ако се <form> постави пре табеле, </form> не може да се постави унутар табеле! Имајте на уму да један формулар не може да се угнезди унутар другог!

# TEXT_BAD_MAIN
source: Only one <main> element is allowed in a document. Subsequent <main> elements have been discarded, which may render the document invalid.
sr: У документу је дозвољен само један <main> елемент. Накнадни <main> елементи су одбачени, па због тога документ може да постане неисправан.

# TEXT_M_SUMMARY
source: The table summary attribute should be used to describe the table structure. It is very helpful for people using non-visual browsers. The scope and headers attributes for table cells are useful for specifying which headers apply to each table cell, enabling non-visual browsers to provide a meaningful context for each cell.
sr: Summary атрибут табеле може да се употреби за опис структуре табеле. Доста помаже људима који не користе визуелне прегледаче. Атрибути scope и headers за ћелије табеле су корисни за навођење заглавља која се примењују на сваку ћелију табеле, па на тај начин омогућавају да невизуелни прегледачи пруже контекст значења за сваку појединачну ћелију.

# TEXT_M_IMAGE_ALT
source: The alt attribute should be used to give a short description of an image; longer descriptions should be given with the longdesc attribute which takes a URL linked to the description. These measures are needed for people using non-graphical browsers.
sr: Атрибут alt би требало да се користи за давање кратког описа слике; дужи описи би требало да се поставе у longdesc атрибут који као вредност узима URL који указује на опис. Ове мере су неопходне људима који не користе графичке прегледаче.

# TEXT_M_IMAGE_MAP
source: Use client-side image maps in preference to server-side image maps as the latter are inaccessible to people using non- graphical browsers. In addition, client-side maps are easier to set up and provide immediate feedback to users.
sr: Радије користите мапе слика на страни клијента уместо слика мапа на страни сервера јер оне могу бити неприступачне људима који не користе графичке прегледаче- Уз то, мапе на страни клијента се једноставније подешавају и корисницима тренутно пружају повратну информацију.

# TEXT_M_LINK_ALT
source: For hypertext links defined using a client-side image map, you need to use the alt attribute to provide a textual description of the link for people using non-graphical browsers.
sr: За коришћење хипертекст линкова дефинисаних употребом слике мапе на клијентској страни, морате да искористите alt атрибут у којем наводите текстуални опис линка људима који не користе графичке прегледаче.

# TEXT_USING_FRAMES
source: Pages designed using frames present problems for people who are either blind or using a browser that doesn't support frames. A frames-based page should always include an alternative layout inside a NOFRAMES element.
sr: Странице дизајниране употребом оквира представљају проблем људима који су или слабовиди или користе прегледач који не подржава оквире. Страница базирана на оквирима би увек требало да укључи алтернативни распоред унутар NOFRAMES елемента.

# FOOTNOTE_TRIM_EMPTY_ELEMENT
source: One or more empty elements were present in the source document but dropped on output. If these elements are necessary or you don't want this behavior, then consider setting the option "drop-empty-elements" to no.
sr: Један или више празних елемената су били присутни у изворном документу, али су изостављени у излазу. Ако су ови елементи неопходни, или ако не желите овакво понашање, размотрите да опцију „drop-empty-elements” поставите на no.

# TEXT_ACCESS_ADVICE1
source: For further advice on how to make your pages accessible see https://www.w3.org/WAI/GL.
sr: За још савета у вези са начином да ваше странице постану приступачне, погледајте https://www.w3.org/WAI/GL.

# TEXT_ACCESS_ADVICE2
source: For further advice on how to make your pages accessible see https://www.w3.org/WAI/GL and https://www.html-tidy.org/accessibility/.
sr: За још савета у вези са начином да ваше странице постану приступачне, погледајте https://www.w3.org/WAI/GL и https://www.html-tidy.org/accessibility/.

# TEXT_USING_LAYER
source: The Cascading Style Sheets (CSS) Positioning mechanism is recommended in preference to the proprietary <LAYER> element due to limited vendor support for LAYER.
sr: Уместо власничког елемента <LAYER>, препоручује се употреба Cascading Style Sheets (CSS) механизма позиционирања јер је подршка произвођача за LAYER елемент ограничена.

# TEXT_USING_SPACER
source: You are recommended to use CSS for controlling white space (e.g. for indentation, margins and line spacing). The proprietary <SPACER> element has limited vendor support.
sr: Препоручује се за контролисање празног простора користите CSS (нпр. за увлачење, маргине и проред). Власнички елемент <SPACER> има ограничену подршку произвођача.

# TEXT_USING_FONT
source: You are recommended to use CSS to specify the font and properties such as its size and color. This will reduce the size of HTML files and make them easier to maintain compared with using <FONT> elements.
sr: Препоручује се да за навођење фонта и његових особина као што су величина и боја користите CSS. То ће да смањи величину HTML фајлова и лакше ће се одржавати у односу на фајлове у којима се користе <FONT> елементи.

# TEXT_USING_NOBR
source: You are recommended to use CSS to control line wrapping. Use "white-space: nowrap" to inhibit wrapping in place of inserting <NOBR>...</NOBR> into the markup.
sr: Препоручује се да за контролу обавијања линија користите CSS. Уместо да за искључивање обавијања у означавање уметнете <NOBR>...</NOBR>, употребите „white-space: nowrap”.

# TEXT_USING_BODY
source: You are recommended to use CSS to specify page and link colors
sr: Препоручује се да навођење боја странице и линка користите CSS

# STRING_CONTENT_LOOKS
source: Document content looks like %s
sr: Садржај документа изгледа овако %s

# STRING_DOCTYPE_GIVEN
source: Doctype given is "%s"
sr: Наведени Doctype је „%s”

# STRING_ERROR_COUNT
source: Tidy found %u %s and %u %s!
sr: Tidy је пронашао %u %s и %u %s!

# STRING_NEEDS_INTERVENTION
source: This document has errors that must be fixed before using HTML Tidy to generate a tidied up version.
sr: Овај документ садржи грешке које се морају исправити пре него што се HTML Tidy употреби за генерисање сређене верзије.

# STRING_NO_ERRORS
source: No warnings or errors were found.
sr: Није пронађено ниједно упозорење нити грешка.

# STRING_NO_SYSID
source: No system identifier in emitted doctype
sr: У емитованом doctype нема ниједном идентификатора система

# STRING_NOT_ALL_SHOWN
source: Tidy found %u %s and %u %s! Not all warnings/errors were shown.
sr: Tidy је пронашао %u %s и %u %s! Нису приказана сва упозорења/грешке.

# TEXT_GENERAL_INFO
source: About HTML Tidy: https://github.com/htacg/tidy-html5 Bug reports and comments: https://github.com/htacg/tidy-html5/issues Official mailing list: https://lists.w3.org/Archives/Public/public-htacg/ Latest HTML specification: https://html.spec.whatwg.org/multipage/ Validate your HTML documents: https://validator.w3.org/nu/ Lobby your company to join the W3C: https://www.w3.org/Consortium
sr: О програму HTML Tidy: https://github.com/htacg/tidy-html5 Извештаји о багу и коментари: https://github.com/htacg/tidy-html5/issues Званична мејлинг листа: https://lists.w3.org/Archives/Public/public-htacg/ Последња HTML спецификација: https://html.spec.whatwg.org/multipage/ Потврдите своје HTML документе: https://validator.w3.org/nu/ Лобирајте да ваша компанија постане члан W3C: https://www.w3.org/Consortium

# TEXT_GENERAL_INFO_PLEA
source: Do you speak a language other than English, or a different variant of English? Consider helping us to localize HTML Tidy. For details please see https://github.com/htacg/tidy-html5/blob/master/README/LOCALIZE.md
sr: Говорите ли неки други језик, а не енглески, или различиту варијанту енглеског? Размотрите могућност да нам помогнете да локализујемо HTML Tidy. За више детаља, молимо вас да погледате страницу https://github.com/htacg/tidy-html5/blob/master/README/LOCALIZE.md

# ADDED_MISSING_CHARSET
source: Added appropriate missing <meta charset=...> to %s
sr: У %s је додата одговарајућа <meta charset=...> која недостаје

# ANCHOR_NOT_UNIQUE
source: %s anchor "%s" already defined
sr: %s сидро „%s” је већ дефинисано

# ANCHOR_DUPLICATED
source: Implicit %s anchor "%s" duplicated by Tidy.
sr: Tidy је дуплирао имплицитно %s сидро „%s”.

# APOS_UNDEFINED
source: named entity &apos; only defined in XML/XHTML
sr: именовани ентитет &apos; је дефинисан само у XML/XHTML

# ATTR_VALUE_NOT_LCASE
source: %s attribute value "%s" must be lower case for XHTML
sr: Вредност „%s” атрибута %s мора бити исписана малим словима у XHTML

# ATTRIBUTE_IS_NOT_ALLOWED
source: %s attribute "is" not allowed for autonomous custom tags.
sr: %s атрибут „is” се не дозвољава за аутономне произвољне ознаке.

# ATTRIBUTE_VALUE_REPLACED
source: %s attribute "%s", incorrect value "%s" replaced
sr: %s атрибут „%s”, замењена је неисправна вредност „%s”

# BACKSLASH_IN_URI
source: %s URI reference contains backslash. Typo?
sr: %s URI референца садржи обрнуту косу црту. Грешка у куцању?

# BAD_ATTRIBUTE_VALUE_REPLACED
source: %s attribute "%s" had invalid value "%s" and has been replaced
sr: %s атрибут „%s” је имао неисправну вредност „%s” која је замењена

# BAD_ATTRIBUTE_VALUE
source: %s attribute "%s" has invalid value "%s"
sr: %s атрибут „%s” има неисправну вредност „%s”

# BAD_CDATA_CONTENT
source: '<' + '/' + letter not allowed here
sr: Овде није дозвољено ’<’ + ’/’ + слово

# BAD_SUMMARY_HTML5
source: The summary attribute on the %s element is obsolete in HTML5
sr: Атрибут summary у елементу %s је застарело у HTML5

# BAD_SURROGATE_LEAD
source: Trailing (Low) surrogate pair U+%04X, with no leading (High) entity, replaced with U+FFFD.
sr: Зачељни (ниски) сурогат пар U+%04X, без водећег (високог) ентитета, замењује се са U+FFFD.

# BAD_SURROGATE_PAIR
source: Have out-of-range surrogate pair U+%04X:U+%04X, replaced with U+FFFD value.
sr: Постоји сурогат пар U+%04X:U+%04X који је ван опсега, замењује се са вредности U+FFFD.

# BAD_SURROGATE_TAIL
source: Leading (High) surrogate pair U+%04X, with no trailing (Low) entity, replaced with U+FFFD.
sr: Водећи (високи) сурогат пар U+%04X, без зачељног (ниског) ентитета, замењује се са U+FFFD.

# CANT_BE_NESTED
source: %s can't be nested
sr: %s не може да се угњезди

# COERCE_TO_ENDTAG
source: <%s> is probably intended as </%s>
sr: Вероватно је <%s> требало да буде </%s>

# CONTENT_AFTER_BODY
source: content occurs after end of body
sr: постоји садржај након краја тела

# DISCARDING_UNEXPECTED
source: discarding unexpected %s
sr: одбацује се неочекивано %s

# DOCTYPE_AFTER_TAGS
source: <!DOCTYPE> isn't allowed after elements
sr: <!DOCTYPE> се не дозвољава након елемената

# DUPLICATE_FRAMESET
source: repeated FRAMESET element
sr: поновљени FRAMESET елемент

# ELEMENT_NOT_EMPTY
source: %s element not empty or not closed
sr: Елемент %s није празан или није затворен

# ELEMENT_VERS_MISMATCH_ERROR
source: %s element not available in %s
sr: Елемент %s није доступан у %s

# ELEMENT_VERS_MISMATCH_WARN
source: %s element not available in %s
sr: Елемент %s није доступан у %s

# ENCODING_MISMATCH
source: specified input encoding (%s) does not match actual input encoding (%s)
sr: наведено кодирање улаза (%s) се не подудара за стварним кодирањем улазног документа (%s)

# ESCAPED_ILLEGAL_URI
source: %s escaping malformed URI reference
sr: %s означава се погрешно формирана URI референца

# FILE_CANT_OPEN
source: Can't open "%s"
sr: Не може да се отвори „%s”

# FILE_CANT_OPEN_CFG
source: Can't open configuration file "%s"
sr: Не може да се отвори конфигурациони фајл „%s”

# FILE_NOT_FILE
source: "%s" is not a file!
sr: „%s” није фајл!

# FIXED_BACKSLASH
source: %s converting backslash in URI to slash
sr: %s обрнута коса црта у URI се претвара у косу црту

# FOUND_STYLE_IN_BODY
source: found <style> tag in <body>! fix-style-tags: yes to move.
sr: пронађена је <style> ознака у <body>! fix-style-tags: yes да се премести.

# ID_NAME_MISMATCH
source: %s id and name attribute value mismatch
sr: %s не подударају се вредности id и name атрибута

# ILLEGAL_NESTING
source: %s shouldn't be nested
sr: %s не би требало да буде угњеждена

# ILLEGAL_URI_CODEPOINT
source: %s illegal characters found in URI
sr: %s у URI су пронађени неважећи карактери

# ILLEGAL_URI_REFERENCE
source: %s improperly escaped URI reference
sr: %s неправилно означена URI референца

# INSERTING_AUTO_ATTRIBUTE
source: %s inserting "%s" attribute using value "%s"
sr: %s умеће се атрибут „%s” користећи вредност „%s”

# INSERTING_TAG
source: inserting implicit <%s>
sr: уметање имплицитног <%s>

# INVALID_ATTRIBUTE
source: %s attribute name "%s" (value="%s") is invalid
sr: %s име атрибута „%s” (вредност=„%s”) није исправно

# INVALID_NCR
source: %s invalid numeric character reference %s
sr: %s неисправна нумеричка карактер референца %s

# INVALID_SGML_CHARS
source: %s invalid character code %s
sr: %s неисправан кôд карактера %s

# INVALID_UTF8
source: %s invalid UTF-8 bytes (char. code %s)
sr: %s неисправни UTF-8 бајтови (кар. кôд %s)

# INVALID_UTF16
source: %s invalid UTF-16 surrogate pair (char. code %s)
sr: %s неисправан UTF-16 сурогат пар (кар. кôд %s)

# INVALID_XML_ID
source: %s cannot copy name attribute to id
sr: %s name атрибут не може да се копира у id

# JOINING_ATTRIBUTE
source: %s joining values of repeated attribute "%s"
sr: %s спајају се вредности поновљеног атрибута „%s”

# MALFORMED_COMMENT
source: tidy replaced adjacent "-" with "="
sr: tidy је заменио суседне „-” са „=”

# MALFORMED_COMMENT_DROPPING
source: dropping a possible comment due to a missing hyphen
sr: одбацује се могући коментар јер недостаје цртица

# MALFORMED_COMMENT_EOS
source: the end of the document was reached before the end of the comment
sr: достигнут је крај документа пре краја коментара

# MALFORMED_COMMENT_WARN
source: detected adjacent hyphens within the comment; consider fix-bad-comments
sr: у коментару су откривене узастопне цртице; размотрите употребу fix-bad-comments

# MALFORMED_DOCTYPE
source: discarding malformed <!DOCTYPE>
sr: одбацује се неисправно формиран <!DOCTYPE>

# MISMATCHED_ATTRIBUTE_ERROR
source: %s attribute "%s" not allowed for %s
sr: %s атрибут „%s” се не дозвољава за %s

# MISMATCHED_ATTRIBUTE_WARN
source: %s attribute "%s" not allowed for %s
sr: %s атрибут „%s” се не дозвољава за %s

# MISSING_ATTR_VALUE
source: %s attribute "%s" lacks value
sr: %s недостаје вредност атрибута „%s”

# MISSING_ATTRIBUTE
source: %s lacks "%s" attribute
sr: %s нема атрибут „%s”

# MISSING_DOCTYPE
source: missing <!DOCTYPE> declaration
sr: недостаје <!DOCTYPE> декларација

# MISSING_ENDTAG_BEFORE
source: missing </%s> before %s
sr: недостаје </%s> пре %s

# MISSING_ENDTAG_FOR
source: missing </%s>
sr: недостаје </%s>

# MISSING_ENDTAG_OPTIONAL
source: missing optional end tag </%s>
sr: недостаје необавезна затварајућа ознака </%s>

# MISSING_IMAGEMAP
source: %s should use client-side image map
sr: %s требало би да се користи слика мапа на страни клијента

# MISSING_QUOTEMARK
source: %s attribute with missing trailing quote mark
sr: %s атрибут којем недостаје знак навода на крају

# MISSING_QUOTEMARK_OPEN
source: value for attribute "%s" missing quote marks
sr: вредности атрибута „%s” недостају знаци навода

# MISSING_SEMICOLON_NCR
source: numeric character reference "%s" doesn't end in ';'
sr: нумеричка карактер референца „%s” се не завршава са ’;’

# MISSING_SEMICOLON
source: entity "%s" doesn't end in ';'
sr: ентитет „%s” се не завршава са ’;’

# MISSING_STARTTAG
source: missing <%s>
sr: недостаје <%s>

# MISSING_TITLE_ELEMENT
source: inserting missing 'title' element
sr: умеће се елемент ’title’ који недостаје

# MOVED_STYLE_TO_HEAD
source: moved <style> tag to <head>! fix-style-tags: no to avoid.
sr: ознака <style> је премештена у <head>! fix-style-tags: no да спречите.

# NESTED_EMPHASIS
source: nested emphasis %s
sr: угњеждено наглашавање %s

# NESTED_QUOTATION
source: nested q elements, possible typo.
sr: угњеждени q елементи, могућа грешка у куцању.

# NEWLINE_IN_URI
source: %s discarding newline in URI reference
sr: %s одбацује се прелом реда у URI референци

# NOFRAMES_CONTENT
source: %s not inside 'noframes' element
sr: %s није унутар ’noframes’ елемента

# NON_MATCHING_ENDTAG
source: replacing unexpected %s with </%s>
sr: замењује се неочекивано %s са </%s>

# OBSOLETE_ELEMENT
source: replacing obsolete element %s with %s
sr: застарели елемент %s се замењује са %s

# OPTION_REMOVED
source: option "%s" no longer exists, and no replacement could be found.
sr: опција „%s” више не постоји, и не може да се пронађе ниједна замена.

# OPTION_REMOVED_APPLIED
source: option "%s" replaced with "%s", which Tidy has set to "%s".
sr: опција „%s” је замењена опцијом „%s”, коју је Tidy поставио на „%s”.

# OPTION_REMOVED_UNAPPLIED
source: option "%s" replaced with "%s", but Tidy could not set it for you.
sr: опција „%s” је замењена са „%s”, али Tidy није могао да је поставу уместо вас.

# PREVIOUS_LOCATION
source: <%s> previously mentioned
sr: <%s> је раније поменуто

# PROPRIETARY_ATTR_VALUE
source: %s proprietary attribute value "%s"
sr: %s вредност „%s” власничког атрибута

# PROPRIETARY_ATTRIBUTE
source: %s proprietary attribute "%s"
sr: %s власнички атрибут „%s”

# PROPRIETARY_ELEMENT
source: %s is not approved by W3C
sr: %s није одобрио W3C

# REMOVED_HTML5
source: %s element removed from HTML5
sr: %s елемент је уклоњен из HTML5

# REPEATED_ATTRIBUTE
source: %s dropping value "%s" for repeated attribute "%s"
sr: %s одбацује се вредност „%s” за поновљени атрибут „%s”

# REPLACING_ELEMENT
source: replacing %s with %s
sr: %s се замењује са %s

# REPLACING_UNEX_ELEMENT
source: replacing unexpected %s with %s
sr: неочекивано %s се замењује са %s

# SPACE_PRECEDING_XMLDECL
source: removing whitespace preceding XML Declaration
sr: уклања се празан простор испред XML декларације

# STRING_ARGUMENT_BAD
source: option "%s" given bad argument "%s"
sr: опцији „%s” је задат погрешан аргумент „%s”

# STRING_MISSING_MALFORMED
source: missing or malformed argument for option: %s
sr: опцији недостаје аргумент или није исправно формиран: %s

# STRING_MUTING_TYPE
source: messages of type "%s" will not be output
sr: поруке типа „%s” се неће исписивати

# STRING_UNKNOWN_OPTION
source: unknown option: %s
sr: непозната опција: %s

# SUSPECTED_MISSING_QUOTE
source: suspected missing quote mark for attribute value
sr: сумња се да недостаје знак навода за вредност атрибута

# TAG_NOT_ALLOWED_IN
source: %s isn't allowed in <%s> elements
sr: %s се не дозвољава у <%s> елементима

# TOO_MANY_ELEMENTS
source: too many %s elements
sr: превише %s елемената

# TRIM_EMPTY_ELEMENT
source: trimming empty %s
sr: скраћује се празно %s

# UNESCAPED_AMPERSAND
source: unescaped & which should be written as &amp;
sr: неозначено & које би требало да се испише као &amp;

# UNEXPECTED_END_OF_FILE_ATTR
source: %s end of file while parsing attributes
sr: %s наишао је крај фајла током парсирања атрибута

# UNEXPECTED_END_OF_FILE
source: unexpected end of file %s
sr: неочекивани крај фајла %s

# UNEXPECTED_ENDTAG_ERR
source: unexpected </%s>
sr: неочекивано </%s>

# UNEXPECTED_ENDTAG_IN
source: unexpected </%s> in <%s>
sr: неочекивано </%s> у <%s>

# UNEXPECTED_ENDTAG
source: unexpected </%s>
sr: неочекивано </%s>

# UNEXPECTED_EQUALSIGN
source: %s unexpected '=', expected attribute name
sr: % неочекивано ’=’, очекивало се име атрибута

# UNEXPECTED_GT
source: %s missing '>' for end of tag
sr: %s недостаје ’>’ затварајуће ознаке

# UNEXPECTED_QUOTEMARK
source: %s unexpected or duplicate quote mark
sr: %s неочекивани или дуплирани знак навода

# UNKNOWN_ELEMENT_LOOKS_CUSTOM
source: %s is not recognized! Did you mean to enable the custom-tags option?
sr: %s се не препознаје! Да ли сте хтели да укључите опцију custom-tags?

# UNKNOWN_ELEMENT
source: %s is not recognized!
sr: %s се не препознаје!

# UNKNOWN_ENTITY
source: unescaped & or unknown entity "%s"
sr: неозначено & или непознат ентитет „%s”

# USING_BR_INPLACE_OF
source: using <br> in place of %s
sr: користи се <br> уместо %s

# VENDOR_SPECIFIC_CHARS
source: %s invalid character code %s
sr: %s неисправан кôд карактера %s

# WHITE_IN_URI
source: %s discarding whitespace in URI reference
sr: %s одбацује се празан простор у URI референци

# XML_DECLARATION_DETECTED
source: An XML declaration was detected. Did you mean to use input-xml?
sr: Детектована је XML декларација. Да ли сте хтели да употребите input-xml?

# XML_ID_SYNTAX
source: %s ID "%s" uses XML ID syntax
sr: %s ID „%s” користи XML ID ситнаксу

source: blank 'title' element
sr: празан ’title’ елемент

# IMG_MISSING_ALT
source: [1.1.1.1]: <img> missing 'alt' text.
sr: [1.1.1.1]: <img> нема ’alt’ текст.

# IMG_ALT_SUSPICIOUS_FILENAME
source: [1.1.1.2]: suspicious 'alt' text (filename).
sr: [1.1.1.2]: сумњиви ’alt’ текст (име фајла).

# IMG_ALT_SUSPICIOUS_FILE_SIZE
source: [1.1.1.3]: suspicious 'alt' text (file size).
sr: [1.1.1.3]: сумњиви ’alt’ текст (величина фајла).

# IMG_ALT_SUSPICIOUS_PLACEHOLDER
source: [1.1.1.4]: suspicious 'alt' text (placeholder).
sr: [1.1.1.4]: сумњиви ’alt’ текст (чувар места).

# IMG_ALT_SUSPICIOUS_TOO_LONG
source: [1.1.1.10]: suspicious 'alt' text (too long).
sr: [1.1.1.10]: сумњиви ’alt’ текст (сувише дугачак).

# IMG_MISSING_LONGDESC_DLINK
source: [1.1.2.1]: <img> missing 'longdesc' and d-link.
sr: [1.1.2.1]: <img> недостају ’longdesc’ и d-link.

# IMG_MISSING_DLINK
source: [1.1.2.2]: <img> missing d-link.
sr: [1.1.2.2]: <img> недостаје d-link.

# IMG_MISSING_LONGDESC
source: [1.1.2.3]: <img> missing 'longdesc'.
sr: [1.1.2.3]: <img> недостаје ’longdesc’.

# IMG_BUTTON_MISSING_ALT
source: [1.1.3.1]: <img> (button) missing 'alt' text.
sr: [1.1.3.1]: <img> (дугме) недостаје ’alt’ текст.

# APPLET_MISSING_ALT
source: [1.1.4.1]: <applet> missing alternate content.
sr: [1.1.4.1]: <applet> недостаје алтернативни садржај.

# OBJECT_MISSING_ALT
source: [1.1.5.1]: <object> missing alternate content.
sr: [1.1.5.1]: <object> недостаје алтернативни садржај.

# AUDIO_MISSING_TEXT_WAV
source: [1.1.6.1]: audio missing text transcript (wav).
sr: [1.1.6.1]: звуку недостаје текстуални транскрипт (wav).

# AUDIO_MISSING_TEXT_AU
source: [1.1.6.2]: audio missing text transcript (au).
sr: [1.1.6.2]: звуку недостаје текстуални транскрипт (au).

# AUDIO_MISSING_TEXT_AIFF
source: [1.1.6.3]: audio missing text transcript (aiff).
sr: [1.1.6.3]: звуку недостаје текстуални транскрипт (aiff).

# AUDIO_MISSING_TEXT_SND
source: [1.1.6.4]: audio missing text transcript (snd).
sr: [1.1.6.4]: звуку недостаје текстуални транскрипт (snd).

# AUDIO_MISSING_TEXT_RA
source: [1.1.6.5]: audio missing text transcript (ra).
sr: [1.1.6.5]: звуку недостаје текстуални транскрипт (ra).

# AUDIO_MISSING_TEXT_RM
source: [1.1.6.6]: audio missing text transcript (rm).
sr: [1.1.6.6]: звуку недостаје текстуални транскрипт (rm).

# FRAME_MISSING_LONGDESC
source: [1.1.8.1]: <frame> may require 'longdesc'.
sr: [1.1.8.1]: <frame> може да захтева ’longdesc’.
