Repository: htacg/tidy-html5
Catalog: localize/translations/language_*.po
Languages: sr

# TidyJoinClasses
source: This option specifies if Tidy should combine class names to generate a single, new class name if multiple class assignments are detected on an element.
sr: Ова опција наводи да ли би Tidy требало да комбинује имена класа тако да генерише јединствено, ново име класе, онда када се у елементу открију вишеструке доделе класа.

# TidyJoinStyles
source: This option specifies if Tidy should combine styles to generate a single, new style if multiple style values are detected on an element.
sr: Ова опција наводи да ли би Tidy требало да комбинује стилове тако да генерише јединствени, нови стил, онда када се у елементу открију вишеструке вредности стила.

# TidyKeepFileTimes
source: This option specifies if Tidy should keep the original modification time of files that Tidy modifies in place. <br/>Setting the option to <var>yes</var> allows you to tidy files without changing the file modification date, which may be useful with certain tools that use the modification date for things such as automatic server deployment.<br/>Note this feature is not supported on some platforms.
sr: Ова опција наводи да ли би Tidy требало да задржи оригинално време измене фајлова које мења у-месту. <br/>Постављањем ове опције на <var>yes</var> можете да средите фајлове без измене датума измене фајла, што може бити корисно у случају неких алата који датум измене користе за ствари као што је аутоматско постављање на сервер.<br/>Имајте на уму да се ова могућност не подржава на неким платформама.

# TidyKeepTabs
source: With the default <var>no</var> Tidy will replace all source tabs with spaces, controlled by the option <code>tab-size</code>, and the current line offset. Of course, except in the special blocks/elements enumerated below, this will later be reduced to just one space. <br/>If set <var>yes</var> this option specifies Tidy should keep certain tabs found in the source, but only in preformatted blocks like <code>&lt;pre&gt;</code>, and other CDATA elements like <code>&lt;script&gt;</code>, <code>&lt;style&gt;</code>, and other pseudo elements like <code>&lt;?php ... ?&gt;</code>. As always, all other tabs, or sequences of tabs, in the source will continue to be replaced with a space.
sr: Са подразумеваном вредности <var>no</var> Tidy ће све табулаторе у улазу да замени размацима на начин контролисан опцијом <code>tab-size</code> и текућим померајем линије. Наравно, осим у случају специјалних блокова/елемената набројаних испод, ово ће се касније редуковати само на један размак. <br/>Ако се постави на <var>yes</var> ова опција наводи да Tidy одређене табулаторе треба да задржи када их пронађе у извору, али само у преформатираним блоковима као што су <code>&lt;pre&gt;</code> и остали CDATA елементи као што су <code>&lt;script&gt;</code>, <code>&lt;style&gt;</code> и остали псеудо елементи као што су <code>&lt;?php ... ?&gt;</code>. Као увек, сви остали табулатори или низови табулатора у извору ће наставити да се замењују размаком.

# TidyLiteralAttribs
source: This option specifies how Tidy deals with whitespace characters within attribute values. <br/>If the value is <var>no</var> Tidy normalizes attribute values by replacing any newline or tab with a single space, and further by replacing any contiguous whitespace with a single space. <br/>To force Tidy to preserve the original, literal values of all attributes and ensure that whitespace within attribute values is passed through unchanged, set this option to <var>yes</var>.
sr: Ова опција наводи како Tidy обрађује карактере празног простора унутар вредности атрибута. <br/>Ако је вредност <var>no</var> Tidy нормализује вредности атрибута тако што све преломе редова или табулаторе замењује једним размаком, а уз то и сваку групу узастопних карактера празног простора једним размаком. <br/>Ако желите принудити Tidy да задржи оригиналне, дословне вредности свих атрибута и обезбедите да се празан простор унутар вредности атрибута прослеђује на излаз неизмењен, поставите ову опцију на <var>yes</var>.

# TidyLogicalEmphasis
source: This option specifies if Tidy should replace any occurrence of <code>&lt;i&gt;</code> with <code>&lt;em&gt;</code> and any occurrence of <code>&lt;b&gt;</code> with <code>&lt;strong&gt;</code>. Any attributes are preserved unchanged. <br/>This option can be set independently of the <code>clean</code> option.
sr: Ова опција наводи да ли Tidy треба да замени било које појављивање <code>&lt;i&gt;</code> са <code>&lt;em&gt;</code> и било које појављивање <code>&lt;b&gt;</code> са <code>&lt;strong&gt;</code>. Сви атрибути остају неизмењени. <br/>Ова опција може да се постави независно од опције <code>clean</code>.

# TidyLowerLiterals
source: This option specifies if Tidy should convert the value of an attribute that takes a list of predefined values to lower case. <br/>This is required for XHTML documents.
sr: Ова опција наводи да ли би Tidy требало да претвори вредност атрибута који узима листу предефинисаних вредности у мала слова. <br/>Ово је потребно за XHTML документе.

# TidyMakeBare
source: This option specifies if Tidy should replace smart quotes and em dashes with ASCII, and output spaces rather than non-breaking spaces, where they exist in the input.
sr: Ова опција наводи да ли Tidy треба да замени типографске наводнике и em црте са ASCII карактерима, и да тамо где постоје у улазу уместо непреламајућих размака у излаз постави размаке.

# TidyMakeClean
source: This option specifies if Tidy should perform cleaning of some legacy presentational tags (currently <code>&lt;i&gt;</code>, <code>&lt;b&gt;</code>, <code>&lt;center&gt;</code> when enclosed within appropriate inline tags, and <code>&lt;font&gt;</code>). If set to <var>yes</var>, then the legacy tags will be replaced with CSS <code>&lt;style&gt;</code> tags and structural markup as appropriate.
sr: Ова опција наводи да ли би Tidy требало да обавља чишћење неких застарелих презентационих ознака (тренутно су то <code>&lt;i&gt;</code>, <code>&lt;b&gt;</code>, <code>&lt;center&gt;</code> онда када су окружени одговарајућим ознакама унутар линије, као и <code>&lt;font&gt;</code>). Ако се постави на <var>yes</var>, онда ће се застареле ознаке заменити са CSS <code>&lt;style&gt;</code> ознакама и погодним структурним означавањем.

# TidyMark
source: This option specifies if Tidy should add a <code>meta</code> element to the document head to indicate that the document has been tidied. <br/>Tidy won't add a meta element if one is already present.
sr: Ова опција наводи да ли би Tidy требало да дода <code>meta</code> елемент главу документа који означава да је документ био сређен. <br/>Tidy неће додати meta елемент ако је неки већ присутан.

# TidyMergeDivs
source: This option can be used to modify the behavior of <code>clean</code> when set to <var>yes</var>.<br/>This option specifies if Tidy should merge nested <code>&lt;div&gt;</code> such as <code>&lt;div&gt;&lt;div&gt;...&lt;/div&gt;&lt;/div&gt;</code>. <br/>If set to <var>auto</var> the attributes of the inner <code>&lt;div&gt;</code> are moved to the outer one. Nested <code>&lt;div&gt;</code> with <code>id</code> attributes are <em>not</em> merged. <br/>If set to <var>yes</var> the attributes of the inner <code>&lt;div&gt;</code> are discarded with the exception of <code>class</code> and <code>style</code>.
sr: Ова опција може да се употреби за измену понашања опције <code>clean</code> када је она постављена на <var>yes</var>.<br/>Ова опција наводу да ли би Tidy требало да споји угњеждене <code>&lt;div&gt;</code> ознаке као што је <code>&lt;div&gt;&lt;div&gt;...&lt;/div&gt;&lt;/div&gt;</code>. <br/>Ако се постави на <var>auto</var> атрибути унутрашње <code>&lt;div&gt;</code> ознаке се премештају у спољашњу. Угњеждене <code>&lt;div&gt;</code> са<code>id</code> атрибутима се <em>не</em> спајају. <br/>Ако се постави на <var>yes</var> атрибути унутрашње <code>&lt;div&gt;</code> ознаке се одбацују са изузетком <code>class</code> и <code>style</code>.

# TidyMergeEmphasis
source: This option specifies if Tidy should merge nested <code>&lt;b&gt;</code> and <code>&lt;i&gt;</code> elements; for example, for the case <br/><code>&lt;b class="rtop-2"&gt;foo &lt;b class="r2-2"&gt;bar&lt;/b&gt; baz&lt;/b&gt;</code>, <br/>Tidy will output <code>&lt;b class="rtop-2"&gt;foo bar baz&lt;/b&gt;</code>.
sr: Ова опција наводи да ли би Tidy требало да споји угњеждене <code>&lt;b&gt;</code> и <code>&lt;i&gt;</code> елементе; на пример, у случају <br/><code>&lt;b class="rtop-2"&gt;foo &lt;b class="r2-2"&gt;bar&lt;/b&gt; baz&lt;/b&gt;</code>, <br/>Tidy ће да испише на излаз <code>&lt;b class="rtop-2"&gt;foo bar baz&lt;/b&gt;</code>.

# TidyMergeSpans
source: This option can be used to modify the behavior of <code>clean</code> when set to <var>yes</var>.<br/>This option specifies if Tidy should merge nested <code>&lt;span&gt;</code> such as <code>&lt;span&gt;&lt;span&gt;...&lt;/span&gt;&lt;/span&gt;</code>. <br/>The algorithm is identical to the one used by <code>merge-divs</code>.
sr: Ова опција може да се употреби за измену понашања опције <code>clean</code> када је она постављена на <var>yes</var>.<br/>Ова опција наводи да ли би Tidy требало да споју угњеждене <code>&lt;span&gt;</code> ознаке као што је <code>&lt;span&gt;&lt;span&gt;...&lt;/span&gt;&lt;/span&gt;</code>. <br/>Алгоритам је идентичан оном који се користи за <code>merge-divs</code>.

# TidyNCR
source: This option specifies if Tidy should allow numeric character references.
sr: Ова опција наводи да ли би Tidy требало да дозволи нумеричке карактер референце.

# TidyNewline
source: The default is appropriate to the current platform. <br/>Generally <var>CRLF</var> on PC-DOS, Windows and OS/2; <var>CR</var> on Classic Mac OS; and <var>LF</var> everywhere else (Linux, macOS, and Unix).
sr: Подразумевана вредност је она која одговара тренутној платформи. <br/>У општем случају <var>CRLF</var> на PC-DOS, Windows и OS/2; <var>CR</var> на класичном Mac OS; и <var>LF</var> на свим осталим (Linux, macOS, и Unix).

# TidyNumEntities
source: This option specifies if Tidy should output entities other than the built-in HTML entities (<code>&amp;amp;</code>, <code>&amp;lt;</code>, <code>&amp;gt;</code>, and <code>&amp;quot;</code>) in the numeric rather than the named entity form. <br/>Only entities compatible with the DOCTYPE declaration generated are used. <br/>Entities that can be represented in the output encoding are translated correspondingly.
sr: Ова опција наводи да ли би Tidy требало да исписује и ентитете који нису уграђени HTML ентитети (<code>&amp;amp;</code>, <code>&amp;lt;</code>, <code>&amp;gt;</code> и <code>&amp;quot;</code>) у нумеричком облику, а не у форми именованог ентитета. <br/>Користе се само ентитети компатибилни са DOCTYPE декларацијом која се користи за генерисани текст. <br/>Ентитети који могу да се представе у излазном кодирању се преводе у одговарајуће карактере.

# TidyOmitOptionalTags
source: This option specifies if Tidy should omit optional start tags and end tags when generating output. <br/>Setting this option causes all tags for the <code>&lt;html&gt;</code>, <code>&lt;head&gt;</code>, and <code>&lt;body&gt;</code> elements to be omitted from output, as well as such end tags as <code>&lt;/p&gt;</code>, <code>&lt;/li&gt;</code>, <code>&lt;/dt&gt;</code>, <code>&lt;/dd&gt;</code>, <code>&lt;/option&gt;</code>, <code>&lt;/tr&gt;</code>, <code>&lt;/td&gt;</code>, and <code>&lt;/th&gt;</code>. <br/>This option is ignored for XML output.
sr: Ова опција наводи да ли би приликом генерисања излаза Tidy требало да изостави отварајуће и затварајуће ознаке које нису обавезне. <br/>Постављање ове опције чини да се све ознаке за <code>&lt;html&gt;</code>, <code>&lt;head&gt;</code> и <code>&lt;body&gt;</code> елементе изоставе из излаза, као и такве затварајуће ознаке као што су <code>&lt;/p&gt;</code>, <code>&lt;/li&gt;</code>, <code>&lt;/dt&gt;</code>, <code>&lt;/dd&gt;</code>, <code>&lt;/option&gt;</code>, <code>&lt;/tr&gt;</code>, <code>&lt;/td&gt;</code>, and <code>&lt;/th&gt;</code>. <br/>Ова опција се игнорише за XML излаз.

# TidyOutCharEncoding
source: This option specifies the character encoding Tidy uses for output. Some of the output encodings affect whether or not some characters are translated to entities, although in all cases, some entities will be written according to other Tidy configuration options. <br/>For <var>ascii</var>, <var>mac</var>, and <var>win1252</var> output encodings, entities will be used for all characters with values over 127. <br/>For <var>raw</var> output, Tidy will write values above 127 without translating them to entities. <br/>Output using <var>latin1</var> will cause Tidy to write character values higher than 255 as entities. <br/>The UTF family such as <var>utf8</var> will write output in the respective UTF encoding. <br/>Asian output encodings such as <var>iso2022</var> will write output in the specified encoding, assuming a corresponding <code>input-encoding</code> was specified. <br/>Tidy is not an encoding converter. Although the Latin and UTF encodings can be mixed freely, it is not possible to convert Asian encodings to Latin encodings with Tidy.
sr: Ова опција наводи које кодирање карактера Tidy користи за излаз. Нека од излазних кодирања утичу на то да ли ће се неки карактери превести у ентитете, мада у свим случајевима, неки ентитети ће се записивати сагласно са осталим опцијама Tidy конфигурације. <br/>За <var>ascii</var>, <var>mac</var> и <var>win1252</var> кодирања излаза, ентитети ће се користити за све карактере чија је вредност изнад 127. <br/>За <var>raw</var> излаз, Tidy ће да испише вредности преко 127 и неће их преводити у ентитете. <br/>Када се излаз исписује употребом <var>latin1</var> кодирања Tidy ће да уписује све вредности карактера веће од 255 као ентитете. <br/>UTF породицом, као што је <var>utf8</var>, излаз се пише у одговарајућем UTF кодирању. <br/>Азијским излазним кодирањем, као што је <var>iso2022</var>, излаз ће се исписивати наведеним кодирањем, претпостављајући да је наведено одговарајуће <code>input-encoding</code>. <br/>Tidy није претварач кодирања. Мада латинична и UTF кодирања могу слободно да се мешају, програмом Tidy није могуће претварање из азијских кодирања у латинична.

# TidyOutFile
source: This option specifies the output file Tidy uses for markup. Normally markup is written to <code>stdout</code>.
sr: Ова опција наводи излазни фајл који Tidy користи за означену текст. Означени текст се обично исписује не <code>stdout</code>.

# TidyOutputBOM
source: This option specifies if Tidy should write a Unicode Byte Order Mark character (BOM; also known as Zero Width No-Break Space; has value of U+FEFF) to the beginning of the output, and only applies to UTF-8 and UTF-16 output encodings. <br/>If set to <var>auto</var> this option causes Tidy to write a BOM to the output only if a BOM was present at the beginning of the input. <br/>A BOM is always written for XML/XHTML output using UTF-16 output encodings.
sr: Ова опција наводи да ли би Tidy требало да исписује Unicode Byte Order Mark карактер (BOM; познат и под називом Zero Width No-Break Space; има вредност U+FEFF) на почетак излаза, и примењује се само на UTF-8 и UTF-16 кодирања излаза. <br/>Ако се постави на <var>auto</var> Tidy ће да исписује BOM на излаз само онда када је BOM био присутан на почетку улаза. <br/>BOM се увек исписује за XML/XHTML излаз који користи UTF-16 кодирање излаза.

# TidyPPrintTabs
source: This option specifies if Tidy should indent with tabs instead of spaces, assuming <code>indent</code> is <var>yes</var>. <br/>Set it to <var>yes</var> to indent using tabs instead of the default spaces. <br/>Use the option <code>indent-spaces</code> to control the number of tabs output per level of indent. Note that when <code>indent-with-tabs</code> is enabled the default value of <code>indent-spaces</code> is reset to <var>1</var>. <br/>Note <code>tab-size</code> controls converting input tabs to spaces. Set it to zero to retain input tabs.
sr: Ова опција наводи да ли би Tidy требало да врши увлачење табулаторима уместо размацима, под претпоставком да опција <code>indent</code> има вредност <var>yes</var>. <br/>Поставите је на <var>yes</var> ако желите да се текст увлачи табулаторима уместо подразумеваним размацима. <br/>Користите опцију <code>indent-spaces</code> да контролишете број табулатора у излазу по нивоу увлачења. Имајте на уму да када је укључена опција <code>indent-with-tabs</code>, подразумевана вредност опције <code>indent-spaces</code> се ресетује на <var>1</var>. <br/>Напомена: <code>tab-size</code> контролише претварање улазних табулатора у размаке. Поставите је на нулу ако желите да задржите табулаторе са улаза.

# TidyPreserveEntities
source: This option specifies if Tidy should preserve well-formed entities as found in the input.
sr: Ова опција наводи да ли Tidy треба да очува добро формиране ентитете, онакве какви се пронађу у улазу.

# TidyPreTags
source: This option specifies new tags that are to be processed in exactly the same way as HTML's <code>&lt;pre&gt;</code> element. This option takes a space or comma separated list of tag names. <br/>Unless you declare new tags, Tidy will refuse to generate a tidied file if the input includes previously unknown tags. <br/>Note you cannot as yet add new CDATA elements. <br/>This option is ignored in XML mode.
sr: Ова опција наводи нове ознаке које треба да се обраде на потпуно исти начин као HTML елемент <code>&lt;pre&gt;</code>. Њена вредност је листа имена ознака раздвојених размацима или запетама. <br/>Ако не декларишете нове ознаке, Tidy ће одбити да генерише сређени фајл онда када се у улазу налазе непознате ознаке. <br/>Имајте на уму да још увек не можете да додате нове CDATA елементе. <br/>Ова опција се игнорише у XML режиму.

# TidyPriorityAttributes
source: This option allows prioritizing the writing of attributes in tidied documents, allowing them to written before the other attributes of an element. For example, you might specify that <strong>id</strong> and <strong>name</strong> are written before every other attribute. <br/>This option takes a space or comma separated list of attribute names.
sr: Ова опција омогућава приоритизацију уписивања атрибута у сређеним документима тако што омогућава да се упишу пре осталих атрибута елемента. На пример, могли бисте навести да се <strong>id</strong> и <strong>name</strong> исписују пре било којих других атрибута. <br/>Вредност ове опције представља листа имена атрибута раздвојена размацима или запетама.

# TidyPunctWrap
source: This option specifies if Tidy should line wrap after some Unicode or Chinese punctuation characters.
sr: Ова опција наводи да ли би Tidy требало да обавије линију након неких Unicode или кинеских интерпункцијских карактера.

# TidyQuiet
source: When enabled, this option limits Tidy's non-document output to report only document warnings and errors.
sr: Када је укључена, ова опција ограничава излаз програма Tidy који није документ само на упозорења и грешке у вези са документом.

# TidyQuoteAmpersand
source: This option specifies if Tidy should output unadorned <code>&amp;</code> characters as <code>&amp;amp;</code>, in legacy doctypes only.
sr: Ова опција наводи да ли би Tidy требало да исписује неукрашене <code>&amp;</code> карактере као <code>&amp;amp;</code>, само у застарелим doctype спецификацијама.

# TidyQuoteMarks
source: This option specifies if Tidy should output <code>&quot;</code> characters as <code>&amp;quot;</code> as is preferred by some editing environments. <br/>The apostrophe character <code>'</code> is written out as <code>&amp;#39;</code> since many web browsers don't yet support <code>&amp;apos;</code>.
sr: Ова опција наводи да ли би Tidy требало да исписује <code>&quot;</code> карактере као <code>&amp;quot;</code>, тј. онако како одговара неким окружењима за уређивање. <br/>Карактер апостроф <code>'</code> се исписује као <code>&amp;#39;</code> јер многи веб прегледачи још увек не подржавају <code>&amp;apos;</code>.

# TidyQuoteNbsp
source: This option specifies if Tidy should output non-breaking space characters as entities, rather than as the Unicode character value 160 (decimal).
sr: Ова опција наводи да ли би Tidy требало да исписује карактере непреламајућег размака као ентитете, а не као Unicode карактер чија је вредност 160 (децимално).

# TidyReplaceColor
source: This option specifies if Tidy should replace numeric values in color attributes with HTML/XHTML color names where defined, e.g. replace <code>#ffffff</code> with <code>white</code>.
sr: Ова опција наводи да ли би Tidy требало да замени бројчане вредности у color атрибутима са HTML/XHTML именима боја онда када су дефинисана, нпр. <code>#ffffff</code> се мења са <code>white</code>.

# TidyShowErrors
source: This option specifies the number Tidy uses to determine if further errors should be shown. If set to <var>0</var>, then no errors are shown.
sr: Ова опција наводи број који Tidy користи да одреди треба ли да прикаже накнадне грешке. Ако је постављена на <var>0</var>, онда се грешке уопште не приказују.

# TidyShowFilename
source: This option specifies if Tidy should show the filename in messages. eg: <br/> tidy -q -e --show-filename yes index.html<br/> index.html: line 43 column 3 - Warning: replacing invalid UTF-8 bytes (char. code U+00A9)
sr: Ова опција наводи да ли би Tidy требало да приказује име фајла у порукама. Нпр.: <br/> tidy -q -e --show-filename yes index.html<br/> index.html: линија 43 колона 3 - Упозорење: замењују се неисправни UTF-8 бајтови (кар. кôд U+00A9)

# TidyShowInfo
source: This option specifies if Tidy should display info-level messages.
sr: Ова опција наводи да ли би Tidy требало да исписује поруке инфо нивоа.

# TidyShowMarkup
source: This option specifies if Tidy should generate a pretty printed version of the markup. Note that Tidy won't generate a pretty printed version if it finds significant errors (see <code>force-output</code>).
sr: Ова опција наводи да ли би Tidy требало да генерише лепо исписану верзију означеног текста. Имајте на уму да Tidy неће генерисати лепо исписану верзију ако пронађе значајне грешке (погледајте <code>force-output</code>).

# TidyShowWarnings
source: This option specifies if Tidy should suppress warnings. This can be useful when a few errors are hidden in a flurry of warnings.
sr: Ова опција наводи да ли би Tidy требало да потисне упозорења. Ово може да буде корисно када је неколико грешака скривено у мору упозорења.

# TidySkipNested
source: This option specifies that Tidy should skip nested tags when parsing script and style data.
sr: Ова опција наводи да ли би Tidy требало да прескочи угњеждене ознаке када парсира script и style податке.

# TidySortAttributes
source: This option specifies that Tidy should sort attributes within an element using the specified sort algorithm. If set to <var>alpha</var>, the algorithm is an ascending alphabetic sort. <br/>When used while sorting with <code>priority-attributes</code>, any attribute sorting will take place after the priority attributes have been output.
sr: Ова опција наводи да би Tidy требало да сортира атрибуте у елементу употребом задатог алгоритма сортирања. Ако се постави на <var>alpha</var>, алгоритам је растуће азбучно сортирање. <br/>Када се користи док се сортира са <code>priority-attributes</code>, било какво сортирање атрибута ће се вршити након исписивања приоритетнихатрибута на излаз.
