Repository: htacg/tidy-html5
Catalog: localize/translations/language_*.po
Languages: sr

# TC_TXT_HELP_3
source: Tidy Configuration Options ========================== Use Tidy's configuration options as command line arguments in the form of "--some-option <value>", for example, "--indent-with-tabs yes". You can also specify a file containing configuration options with the -config <file> directive, or in one or more files specific to your environment (see next section). For a list of all configuration options, use "-help-config" or refer to the man page (if your OS has one). Configuration Files =================== If your environment has an $HTML_TIDY variable set to point to a Tidy configuration file, then Tidy will attempt to use it. %s Use "-help-env" for more information about how you can use the environment. to specify Tidy options. Other ===== Input/Output default to stdin/stdout respectively. Single letter options apart from -f may be combined as in: tidy -f errs.txt -imu foo.html Information =========== For more information about HTML Tidy, see https://www.html-tidy.org/ For more information on HTML, see the following: HTML Living Standard (the latest HTML specification) https://html.spec.whatwg.org/multipage/ File bug reports at https://github.com/htacg/tidy-html5/issues/ or send questions and comments to public-htacg@w3.org. Validate your HTML documents using the W3C Nu Markup Validator: https://validator.w3.org/nu/
sr: Tidy опције конфигурације ========================= Користите опције Tidy конфигурације као аргументе командне линије у облику „--нека-опција <вредност>”, на пример, „--indent-with-tabs yes”. Такође можете да наведете фајл који садржи опције конфигурације директивом -config <фајл>, или у једном или више фајлова у зависности од вашег окружења (погледајте наредни одељак). Да видите листу свих опција конфигурације, употребите „-help-config” или погледајте man страницу (ако је ваш ОС има). Фајлови конфигурације ===================== Ако ваше окружење има променљиву $HTML_TIDY постављену тако да указује на Tidy фајл конфигурације, онда ће Tidy покушати да га употреби. %s Употребите „-help-env” за више информација у вези са начином на који можете да наведете Tidy опције. Остало ===== Улаз/Излаз су подразумевано stdin/stdout редом. Опције једног слова осим -f могу да се комбинују као у: tidy -f errs.txt -imu foo.html Информације =========== За више информација о програму HTML Tidy, погледајте https://www.html-tidy.org/ За више информација о HTML, погледајте следеће: HTML Living Standard (најновија HTML спецификација) https://html.spec.whatwg.org/multipage/ Поднесите извештаје о багу на https://github.com/htacg/tidy-html5/issues/ или пошаљите питања и коментаре на public-htacg@w3.org. Потврдите своје HTML документе W3C Nu валидатором означавања: https://validator.w3.org/nu/

# TC_TXT_HELP_3A
source: Additionally, Tidy will automatically attempt to use configuration specified in these files, if present: %s %s
sr: Уз то, Tidy ће аутоматски покушати да користи конфигурацију наведену у следећим фајловима, ако постоје: %s %s

# TC_TXT_HELP_CONFIG
source: HTML Tidy Configuration Settings Within a file, use the form: wrap: 72 indent: no When specified on the command line, use the form: --wrap 72 --indent no
sr: HTML Tidy поставке конфигурације Унутар фајла, користите формат: wrap: 72 indent: no Када се наводи на командној линији користите облик: --wrap 72 --indent no

# TC_TXT_HELP_CONFIG_NAME
source: Name
sr: Име

# TC_TXT_HELP_CONFIG_TYPE
source: Type
sr: Тип

# TC_TXT_HELP_CONFIG_ALLW
source: Allowable values
sr: Дозвољене вредности

# TC_TXT_HELP_ENV_1
source: Tidy can configure its option values from multiple sources, in the order below. Subsequent use of the same option overrides previous option settings. - Tidy's built-in default values. %s - The file specified in the $HTML_TIDY environment variable: %s - Options in a file specified on the command line. - Options set directly on the command line.
sr: Tidy вредности својих опција може да подеси из више извора, у редоследу приказаном испод. Накнадна употреба исте опције преиначује претходна подешавања те опције. - Уграђене подразумеване вредност програма Tidy. %s - Фајл наведен у вредности $HTML_TIDY променљиве окружења: %s - Опције у фајлу наведеном у командној линији. - Опције постављене директно у командној линији.

# TC_TXT_HELP_ENV_1A
source: - The system runtime configuration file: %s - The user runtime configuration file: %s
sr: - Системски фајл конфигурације током извршавања: %s - Кориснички фајл конфигурације током извршавања: %s

# TC_TXT_HELP_ENV_1B
source: (not currently set)
sr: (тренутно није постављено)

# TC_TXT_HELP_ENV_1C
source: Note that because $HTML_TIDY is set, the user runtime configuration file %s will not be used.
sr: Имајте на уму да пошто је променљива $HTML_TIDY постављена, кориснички фајл конфигурације током извршавања %s се неће користити.

# TC_TXT_HELP_LANG_1
source: The -language (or -lang) option indicates which language Tidy should use to communicate its output. Please note that this is not a document translation service, and only affects the messages that Tidy communicates to you. When used from the command line the -language argument must be used before any arguments that result in output, otherwise Tidy will produce output before it knows which language to use. In addition to standard POSIX language codes, Tidy is capable of understanding legacy Windows language codes. Please note that this list indicates codes Tidy understands, and does not indicate that the language is currently installed. The rightmost column indicates how Tidy will understand the legacy Windows name.
sr: Опција -language (или -lang) наводи језик који би Tidy требало да користи за испис свог излаза. Молимо вас да имате на уму да ово није сервис за превођење документа, и да само утиче на поруке које вам Tidy исписује. Када се користи из командне линије, аргумент -language мора да се употреби пре било којих аргумената који исписују излаз, у супротном ће Tidy да произведе излаз пре него што буде знао који језик да употреби. Уз стандардне POSIX кодове језика, Tidy има могућност да разуме застареле Windows кодове језика. Молимо вас да имате на уму да ова листа наводи кодове које Tidy разуме, и не означава да је језик тренутно инсталиран. Крајња десна колона наводи како ће Tidy разумети застарело Windows име.

# TC_TXT_HELP_LANG_2
source: The following languages are currently installed in Tidy. Please note that there's no guarantee that they are complete; only that one developer or another started to add the language indicated. Incomplete localizations will default to "en" when necessary. Please report instances of incorrect strings to the Tidy team.
sr: Тренутно су у програм Tidy инсталирани следећи језици. Молимо вас да имате на ума да нема гаранције да су они комплетни; само да је један програмер или други почео да додаје наведени језик. Када је то потребно, локализације које нису комплетне ће преузети „en”. Молимо вас да Tidy тиму пријавите случајеве неисправних стрингова.

# TC_TXT_HELP_LANG_3
source: If Tidy is able to determine your locale then Tidy will use the locale's language automatically. For example Unix-like systems use a $LANG and/or $LC_ALL environment variable. Consult your operating system documentation for more information. Tidy is currently using locale %s.
sr: Ако је Tidy у могућности да одреди ваш локалитет, онда ће Tidy аутоматски да употреби језик тог локалитета. На пример, системи слични са Unix користе променљиву окружења $LANG и/или $LC_ALL. Погледајте документацију вашег система ако желите да сазнате више. Tidy тренутно користи локалитет %s.
