Repository: htacg/tidy-html5
Catalog: localize/translations/language_*.po
Languages: sr

# TidyAccessibilityCheckLevel
source: This option specifies what level of accessibility checking, if any, that Tidy should perform. <br/>Level <var>0 (Tidy Classic)</var> performs no additional accessibility checking. <br/>Level <var>1 (Priority 1 Checks)</var> performs the Priority Level 1 checks.<br/>Level <var>2 (Priority 2 Checks)</var> performs the Priority Level 1 and 2 checks.<br/>Level <var>3 (Priority 3 Checks)</var> performs the Priority Level 1, 2, and 3 checks.<br/>For more information on Tidy's accessibility checking, including the specific checks that are made for each Priority Level, please visit <a href="https://www.html-tidy.org/accessibility/"> Tidy's Accessibility Page</a>.
sr: Ова опција навода да ли и који ниво провере приступачности би Tidy требало да изврши.<br/>Ниво <var>0 (Tidy класични)</var> не врши се додатна провера приступачности.<br/>Ниво <var>1 (Провере приоритета 1)</var> извршавају се провере 1. нивоа приоритета.<br/>Ниво <var>2 (Провере приоритета 2)</var> извршавају се провере 1. и 2. нивоа приоритета.<br/>Ниво <var>3 (Провере приоритета 3)</var> извршавају се провере 1., 2. и 3. нивоа приоритета.<br/>Ако желите да сазнате више о Tidy провери приступачности, укључујући специфичне провере које се извршавају на сваком од нивоа приоритета, молимо вас да посетите <a href="https://www.html-tidy.org/accessibility/"> Tidy страницу о приступачности</a>.

# TidyAltText
source: This option specifies the default <code>alt=</code> text Tidy uses for <code>&lt;img&gt;</code> attributes when the <code>alt=</code> attribute is missing. <br/>Use with care, as it is your responsibility to make your documents accessible to people who cannot see the images.
sr: Ова опција наводи подразумевани <code>alt=</code> текст који Tidy користи за <code>&lt;img&gt;</code> атрибуте у случају да <code>alt=</code> атрибут недостаје. <br/>Користите пажљиво, јер је одговорност да своје документе учините приступачним људима који не могу да виде слике на вама.

# TidyAnchorAsName
source: This option controls the deletion or addition of the <code>name</code> attribute in elements where it can serve as anchor. <br/>If set to <var>yes</var> a <code>name</code> attribute, if not already existing, is added along an existing <code>id</code> attribute if the DTD allows it. <br/>If set to <var>no</var> any existing name attribute is removed if an <code>id</code> attribute exists or has been added.
sr: Ова опција контролише брисање или додавање <code>name</code> атрибута у елементе у којима може да служи као сидро. <br/>Ако се постави на <var>yes</var> атрибут <code>name</code> се, у случају да већ не постоји, додаје уз постојећи атрибут <code>id</code> када DTD то дозвољава. <br/>Ако се постави на <var>no</var> уклања се било који постојећи name атрибут ако постоји <code>id</code> атрибут или ако је додат.

# TidyAsciiChars
source: Can be used to modify behavior of the <code>clean</code> option when set to <var>yes</var>. <br/>If set to <var>yes</var> when using <code>clean</code>, <code>&amp;emdash;</code>, <code>&amp;rdquo;</code>, and other named character entities are downgraded to their closest ASCII equivalents.
sr: Може да се употреби за промену понашања опције <code>clean</code> када се постави на <var>yes</var>. <br/>Ако се постави на <var>yes</var> када се користи <code>clean</code>, <code>&amp;emdash;</code>, <code>&amp;rdquo;</code> и остали именовани карактер ентитети се упрошћују на њихове најближе одговарајуће ASCII еквиваленте.

# TidyBlockTags
source: This option specifies new block-level tags. This option takes a space or comma separated list of tag names. <br/>Unless you declare new tags, Tidy will refuse to generate a tidied file if the input includes previously unknown tags. <br/>Note you can't change the content model for elements such as <code>&lt;table&gt;</code>, <code>&lt;ul&gt;</code>, <code>&lt;ol&gt;</code> and <code>&lt;dl&gt;</code>. <br/>This option is ignored in XML mode.
sr: Ова опција наводи нове ознаке блок нивоа. Она као вредност узима листу имена ознака раздвојених размацима или запетама. <br/>У случају да не декларишете нове ознаке, Tidy ће одбити да генерише сређени фајл када се у улазном документу налазе претходно непознате ознаке. <br/>Имајте на уму да не можете променити модел садржаја за елементе као што су <code>&lt;table&gt;</code>, <code>&lt;ul&gt;</code>, <code>&lt;ol&gt;</code> и <code>&lt;dl&gt;</code>. <br/>Ова опција се игнорише у XML режиму.

# TidyBodyOnly
source: This option specifies if Tidy should print only the contents of the body tag as an HTML fragment. <br/>If set to <var>auto</var>, this is performed only if the body tag has been inferred. <br/>Useful for incorporating existing whole pages as a portion of another page. <br/>This option has no effect if XML output is requested.
sr: Ова опција наводи да ли би Tidy требало да као HTML фрагмент штампа само садржај body ознаке. <br/>Ако се постави на <var>auto</var>, ово се изводу само ако је body ознака изведена. <br/>Корисно је да се као део неке странице укључе комплетне постојеће странице. <br/>Ова опција нема ефекат ако се захтева XML излаз.

# TidyBreakBeforeBR
source: This option specifies if Tidy should output a line break before each <code>&lt;br&gt;</code> element.
sr: Ова опција наводи да ли би Tidy пре сваког <code>&lt;br&gt;</code> елемента требало да постави прелом линије.

# TidyCharEncoding
source: This option specifies the character encoding Tidy uses for input, and when set, automatically chooses an appropriate character encoding to be used for output. The output encoding Tidy chooses may be different from the input encoding. <br/>For <var>ascii</var>, <var>latin0</var>, <var>ibm858</var>, <var>mac</var>, and <var>win1252</var> input encodings, the <code>output-encoding</code> option will automatically be set to <var>ascii</var>. You can set <code>output-encoding</code> manually to override this. <br/>For other input encodings, the <code>output-encoding</code> option will automatically be set to the the same value. <br/>Regardless of the preset value, you can set <code>output-encoding</code> manually to override this. <br/>Tidy is not an encoding converter. Although the Latin and UTF encodings can be mixed freely, it is not possible to convert Asian encodings to Latin encodings with Tidy.
sr: Ова опција наводи кодирање карактера које Tidy користи за улаз, а када се постави, аутоматски бира одговарајуће кодирање карактера које ће се користити за излаз. Кодирање карактера које Tidy изабере за излаз може да се разликује од кодирања улазних карактера. <br/>За <var>ascii</var>, <var>latin0</var>, <var>ibm858</var>, <var>mac</var> и <var>win1252</var> кодирања улаза, опција <code>output-encoding</code> ће се аутоматски поставити на <var>ascii</var>. Ако то желите да преиначите, <code>output-encoding</code> можете да поставите ручно. <br/>У случају осталих кодирања улаза, опција <code>output-encoding</code> ће се аутоматски поставити на исту вредност. <br/>Без обзира на постављену вредности, <code>output-encoding</code> можете ручно да поставите и тако премостите предодређену вредност. <br/>Tidy није претварач кодирања. Мада латинична и UTF кодирања могу слободно да се мешају, програмом Tidy није могуће претварање из азијских кодирања у латинична.

# TidyCoerceEndTags
source: This option specifies if Tidy should coerce a start tag into an end tag in cases where it looks like an end tag was probably intended; for example, given <br/><code>&lt;span&gt;foo &lt;b&gt;bar&lt;b&gt; baz&lt;/span&gt;</code> <br/>Tidy will output <br/><code>&lt;span&gt;foo &lt;b&gt;bar&lt;/b&gt; baz&lt;/span&gt;</code>
sr: Ова опција наводи да ли би у случајевима када изгледа вероватно да је постојала намера да се постави затварајућа ознака, Tidy требало да принудно претвори отварајућу ознаку у затварајућу; на пример, када је дато <br/><code>&lt;span&gt;foo &lt;b&gt;bar&lt;b&gt; baz&lt;/span&gt;</code> <br/>Tidy ће да испише <br/><code>&lt;span&gt;foo &lt;b&gt;bar&lt;/b&gt; baz&lt;/span&gt;</code>

# TidyCSSPrefix
source: This option specifies the prefix that Tidy uses for styles rules. <br/>By default, <var>c</var> will be used.
sr: Ова опција наводи префикс који Tidy користи за стилска правила. <br/>Подразумевано ће се користити <var>c</var>.

# TidyDecorateInferredUL
source: This option specifies if Tidy should decorate inferred <code>&lt;ul&gt;</code> elements with some CSS markup to avoid indentation to the right.
sr: Ова опција наводи да ли би Tidy требало да украси наслућене <code>&lt;ul&gt;</code> елементе неким CSS означавањем како би се спречило увлачење у десно.

# TidyDoctype
source: This option specifies the DOCTYPE declaration generated by Tidy. <br/>If set to <var>omit</var> the output won't contain a DOCTYPE declaration. Note this this also implies <code>numeric-entities</code> is set to <var>yes</var>.<br/>If set to <var>html5</var> the DOCTYPE is set to <code>&lt;!DOCTYPE html&gt;</code>.<br/>If set to <var>auto</var> (the default) Tidy will use an educated guess based upon the contents of the document. Note that selecting this option will <em>not</em> change the current document's DOCTYPE on output. <br/>If set to <var>strict</var>, Tidy will set the DOCTYPE to the HTML4 or XHTML1 strict DTD.<br/>If set to <var>loose</var>, the DOCTYPE is set to the HTML4 or XHTML1 loose (transitional) DTD.<br/>Alternatively, you can supply a string for the formal public identifier (FPI).<br/>For example: <br/><code>doctype: "-//ACME//DTD HTML 3.14159//EN"</code><br/>If you specify the FPI for an XHTML document, Tidy will set the system identifier to an empty string. For an HTML document, Tidy adds a system identifier only if one was already present in order to preserve the processing mode of some browsers. Tidy leaves the DOCTYPE for generic XML documents unchanged. <br/>This option does not offer a validation of document conformance.
sr: Ова опција наводи DOCTYPE декларацију коју генерише Tidy. <br/>Ако се постави на <var>omit</var> у излазу се неће појавити DOCTYPE декларација. Имајте на уму да ово такође повлачи постављање опције <code>numeric-entities</code> на <var>yes</var>.<br/>Ако се постави на <var>html5</var> DOCTYPE се поставља на <code>&lt;!DOCTYPE html&gt;</code>.<br/>Ако се постави на <var>auto</var> (што је подразумевана вредност) Tidy ће употребити информисано погађање засновано на садржају документа. Имајте на уму да избор ове опције <em>неће</em> променити DOCTYPE текућег документа на излазу. <br/>Ако се постави на <var>strict</var>, Tidy ће поставити DOCTYPE на HTML4 или XHTML1 strict DTD.<br/>Ако се постави на <var>loose</var>, DOCTYPE се поставља на HTML4 или XHTML1 loose (transitional) DTD.<br/>У супротном можете да наведете стринг који ће да се користи као формални јавни идентификатор (FPI).<br/>На пример: <br/><code>doctype: "-//ACME//DTD HTML 3.14159//EN"</code><br/>Ако наведете FPI за XHTML документ, Tidy ће идентификатор система да постави на празан стринг. У случају HTML документа, Tidy додаје идентификатор система само онда када је неки био већ присутан, тако да се у неким прегледачима очува режим обраде. У случају генеричких XML докумената, Tidy не мења DOCTYPE. <br/>Ова опција не омогућава проверу сагласности документа.

# TidyDropEmptyElems
source: This option specifies if Tidy should discard empty elements.
sr: Ова опција наводи да ли би Tidy требало да одбаци празне елементе.

# TidyDropEmptyParas
source: This option specifies if Tidy should discard empty paragraphs.
sr: Ова опција наводи да ли би Tidy требало да одбаци празне пасусе.

# TidyDropPropAttrs
source: This option specifies if Tidy should strip out proprietary attributes, such as Microsoft data binding attributes. Additionally attributes that aren't permitted in the output version of HTML will be dropped if used with <code>strict-tags-attributes</code>.
sr: Ова опција наводи да ли би Tidy требало да уклони власничке атрибуте, као што су Microsoft атрибути везивања података. Уз то, уклониће се и атрибути који нису дозвољени у HTML верзији која се користи за излаз ако се користи у комбинацији са <code>strict-tags-attributes</code>.

# TidyDuplicateAttrs
source: This option specifies if Tidy should keep the first or last attribute, if an attribute is repeated, e.g. has two <code>align</code> attributes.
sr: Ова опција наводи да ли би Tidy требало да задржи први или последњи атрибут, у случају када се атрибут понавља, нпр. ако постоје два <code>align</code> атрибута.

# TidyEmacs
source: This option specifies that Tidy should change the format for reporting errors and warnings to a format that is more easily parsed by GNU Emacs or some other program. It changes them from the default <br/> line &lt;line number&gt; column &lt;column number&gt; - (Error|Warning): &lt;message&gt; <br/>to a form which includes the input filename: <br/> &lt;filename&gt;:&lt;line number&gt;:&lt;column number&gt;: (Error|Warning): &lt;message&gt;
sr: Ова опција наводи да ли би Tidy требало да промени формат извештавања о грешкама и упозорењима на формат који се лакше парсира програмом GNU Emacs или неким другим. Мења се из подразумеваног формата <br/> line &lt;број линије&gt; column &lt;број колоне&gt; - (Error|Warning): &lt;порука&gt; <br/>у облик који укључује и име улазног фајла: <br/> &lt;име_фајла&gt;:&lt;број линије&gt;:&lt;број колоне&gt;: (Error|Warning): &lt;порука&gt;

# TidyEmptyTags
source: This option specifies new empty inline tags. This option takes a space or comma separated list of tag names. <br/>Unless you declare new tags, Tidy will refuse to generate a tidied file if the input includes previously unknown tags. <br/>Remember to also declare empty tags as either inline or blocklevel. <br/>This option is ignored in XML mode.
sr: Ова опција наводи нове празне ознаке унутар линије. Њена вредност је листа имена ознака раздвојених размаком или запетом. <br/>Ако не декларишете нове ознаке, Tidy ће одбити да генерише сређени фајл када се у улазном налазе непознате ознаке. <br/>Не заборавите да празне ознаке такође декларишете као унутар линије или на нивоу блока. <br/>Ова опција се игнорише у XML режиму.

# TidyEncloseBlockText
source: This option specifies if Tidy should insert a <code>&lt;p&gt;</code> element to enclose any text it finds in any element that allows mixed content for HTML transitional but not HTML strict.
sr: Ова опција наводи да ли би Tidy требало да уметне <code>&lt;p&gt;</code> елемент како би уоквирио текст који пронађе у било ком елементу који дозвољава мешовити садржај за HTML transitional, али не и за HTML strict.

# TidyEncloseBodyText
source: This option specifies if Tidy should enclose any text it finds in the body element within a <code>&lt;p&gt;</code> element.<br/>This is useful when you want to take existing HTML and use it with a style sheet.
sr: Ова опција наводи да ли би Tidy требало да уоквири <code>&lt;p&gt;</code> елементом било који текст који пронађе унутар body елемента.<br/>Ово је корисно када постојећи HTML желите да користите са листом стилова.

# TidyErrFile
source: This option specifies the error file Tidy uses for errors and warnings. Normally errors and warnings are output to <code>stderr</code>.
sr: Ова опција наводи фајл грешака који Tidy користи за грешке и упозорења. Обично се грешке и упозорења исписују на <code>stderr</code>.

# TidyEscapeCdata
source: This option specifies if Tidy should convert <code>&lt;![CDATA[]]&gt;</code> sections to normal text.
sr: Ова опција наводи да ли би Tidy требало да одељке <code>&lt;![CDATA[]]&gt;</code> претвори у обични текст.

# TidyEscapeScripts
source: This option causes items that look like closing tags, like <code>&lt;/g</code> to be escaped to <code>&lt;\/g</code>. Set this option to <var>no</var> if you do not want this.
sr: Резултат ове опције је да се ставке који личе на затварајуће ознаке, као што је <code>&lt;/g</code> означавају са <code>&lt;\/g</code>. Ако то не желите, поставите вредност ове опције на <var>no</var>.

# TidyFixBackslash
source: This option specifies if Tidy should replace backslash characters <code>\</code> in URLs with forward slashes <code>/</code>.
sr: Ова опција наводи да ли би Tidy требало да у URL адресама замени карактере обрнуте косе црте <code>\</code> са косим цртама <code>/</code>.

# TidyFixComments
source: This option specifies if Tidy should replace unexpected hyphens with <code>=</code> characters when it comes across adjacent hyphens. <br/>The default is <var>auto</var> will which will act as <var>no</var> for HTML5 document types, and <var>yes</var> for all other document types. <br/>HTML has abandoned SGML comment syntax, and allows adjacent hyphens for all versions of HTML, although XML and XHTML do not. If you plan to support older browsers that require SGML comment syntax, then consider setting this value to <var>yes</var>.
sr: Ова опција наводи да ли би Tidy требало да када наиђе на узастопне цртице замени неочекиване карактерима <code>=</code>. <br/>Подразумевана вредност је <var>auto</var> и она ће у HTML5 типовима докумената да се понаша као <var>no</var>, а као <var>yes</var> за све остале типове докумената. <br/>HTML је напустио SGML синтаксу коментара, тако да се у свим HTML верзијама дозвољавају узастопне цртице, мада то није дозвољено у XML и XHTML. Ако планирате да подржавате старије прегледаче којима је потребна SGML синтакса коментара, онда размотрите потребу да ову вредност поставите на <var>yes</var>.

# TidyFixUri
source: This option specifies if Tidy should check attribute values that carry URIs for illegal characters and if such are found, escape them as HTML4 recommends.
sr: Ова опција наводи да ли Tidy треба да провери постојање неважећих карактера у URI идентификаторима унутар вредности атрибута, па ако се пронађу, онда да их означи онако како то препоручује HTML4 спецификација.

# TidyForceOutput
source: This option specifies if Tidy should produce output even if errors are encountered. <br/>Use this option with care; if Tidy reports an error, this means Tidy was not able to (or is not sure how to) fix the error, so the resulting output may not reflect your intention.
sr: Ова опција наводи да ли би Tidy требало да креира излаз чак и када наиђе на грешке. <br/>Пажљиво користите ову опцију; ако Tidy пријави грешку, то значи да Tidy није могао (или није био сигуран на који начин) да исправи грешку, тако да генерисани излаз можда неће осликавати вашу намеру.

# TidyGDocClean
source: This option specifies if Tidy should enable specific behavior for cleaning up HTML exported from Google Docs.
sr: Ова опција наводи да ли би Tidy требало да укључи одређено понашање за чишћење HTML кода извезеног из Google Docs.

# TidyHideComments
source: This option specifies if Tidy should not print out comments.
sr: Ова опција наводи да ли Tidy не треба да штампа коментаре.

# TidyHtmlOut
source: This option specifies if Tidy should generate pretty printed output, writing it as HTML.
sr: Ова опција наводи да ли Tidy треба да генерише лепо исписан излаз, пишући га као HTML.

# TidyInCharEncoding
source: This option specifies the character encoding Tidy uses for input. Tidy makes certain assumptions about some of the input encodings. <br/>For <var>ascii</var>, Tidy will accept Latin-1 (ISO-8859-1) character values and convert them to entities as necessary. <br/>For <var>raw</var>, Tidy will make no assumptions about the character values and will pass them unchanged to output. <br/>For <var>mac</var> and <var>win1252</var>, vendor specific characters values will be accepted and converted to entities as necessary. <br/>Asian encodings such as <var>iso2022</var> will be handled appropriately assuming the corresponding <code>output-encoding</code> is also specified. <br/>Tidy is not an encoding converter. Although the Latin and UTF encodings can be mixed freely, it is not possible to convert Asian encodings to Latin encodings with Tidy.
sr: Ова опција наводи кодирање карактера које Tidy користи за улаз. Tidy прави неколико претпоставки у вези са одређеним кодирањима улаза. <br/>За <var>ascii</var>, Tidy ће да прихвати Latin-1 (ISO-8859-1) вредности карактера и по потреби ће их претварати у ентитете. <br/>За <var>raw</var>, Tidy неће правити никакве претпоставке у вези са вредностима карактера и проследиће их ба излаз неизмењене. <br/>За <var>mac</var> и <var>win1252</var>, прихватаће се вредности карактера специфичне за произвођача и по потреби ће се претварати у ентитете. <br/>Азијска кодирања као што су <var>iso2022</var> ће се обрађивати на одговарајући начин уз претпоставку да је такође наведена одговарајућа вредност за <code>output-encoding</code>. <br/>Tidy није претварач кодирања. Мада латинична и UTF кодирања могу слободно да се мешају, програмом Tidy није могуће претварање из азијских кодирања у латинична.

# TidyIndentAttributes
source: This option specifies if Tidy should begin each attribute on a new line.
sr: Ова опција наводи да ли би Tidy сваки атрибут требало да почне на новој линији.

# TidyIndentCdata
source: This option specifies if Tidy should indent <code>&lt;![CDATA[]]&gt;</code> sections.
sr: Ова опција наводи да ли би Tidy требало да увлачи <code>&lt;![CDATA[]]&gt;</code> одељке.

# TidyIndentContent
source: This option specifies if Tidy should indent block-level tags. <br/>If set to <var>auto</var> Tidy will decide whether or not to indent the content of tags such as <code>&lt;title&gt;</code>, <code>&lt;h1&gt;</code>-<code>&lt;h6&gt;</code>, <code>&lt;li&gt;</code>, <code>&lt;td&gt;</code>, or <code>&lt;p&gt;</code> based on the content including a block-level element. <br/>Setting <code>indent</code> to <var>yes</var> can expose layout bugs in some browsers. <br/>Use the option <code>indent-spaces</code> to control the number of spaces or tabs output per level of indent, and <code>indent-with-tabs</code> to specify whether spaces or tabs are used.
sr: Ова опција наводи да ли би Tidy требало да увлачи ознаке блок-нивоа. <br/>Ако се постави на <var>auto</var> Tidy ће на основу садржаја који укључује елемент блок-нивоа одлучити да ли да увлачи садржај ознака као што су <code>&lt;title&gt;</code>, <code>&lt;h1&gt;</code>-<code>&lt;h6&gt;</code>, <code>&lt;li&gt;</code>, <code>&lt;td&gt;</code>, или <code>&lt;p&gt;</code>. <br/>Постављање <code>indent</code> на <var>yes</var> може да открије багове у распоређивању странице на неким прегледачима. <br/>Користите опцију <code>indent-spaces</code> за контролу броја размака или табулатора који се исписују за сваки ниво увлачења, а <code>indent-with-tabs</code> да наведете да се за увлачење користе размаци или табулатори.

# TidyIndentSpaces
source: This option specifies the number of spaces or tabs that Tidy uses to indent content when <code>indent</code> is enabled. <br/>Note that the default value for this option is dependent upon the value of <code>indent-with-tabs</code> (see also).
sr: Ова опција наводи број размака или табулатора које Tidy користи за увлачење садржаја када се укључи <code>indent</code>. <br/>Имајте на уму да подразумевана вредност ове опције зависи од вредности опције <code>indent-with-tabs</code> (погледајте и њу).

# TidyInlineTags
source: This option specifies new non-empty inline tags. This option takes a space or comma separated list of tag names. <br/>Unless you declare new tags, Tidy will refuse to generate a tidied file if the input includes previously unknown tags. <br/>This option is ignored in XML mode.
sr: Ова опција наводи нове ознаке унутар линије које нису празне. Њена вредност је листа имена ознака раздвојених размацима или запетама. <br/>Ако не декларишете нове ознаке, Tidy ће одбити да генерише сређени фајл када се у улазу нађу непознате ознаке. <br/>Ова опција се игнорише у XML режиму.
